{
  "root_text": {
    "uid": "sn12.32",
    "lang": "vi",
    "is_root": false,
    "title": "Kaḷāra",
    "author": "Thích Minh Châu",
    "author_short": "Minh Châu",
    "author_uid": "minh_chau",
    "next": {
      "author_uid": "minh_chau",
      "lang": "vi",
      "name": "Grounds for Knowledge ",
      "uid": "sn12.33"
    },
    "previous": {
      "author_uid": "minh_chau",
      "lang": "vi",
      "name": "What Has Come to Be ",
      "uid": "sn12.31"
    },
    "text": "<!DOCTYPE html>\n<html>\n<head>\n<meta charset='UTF-8'>\n<meta name='author' content='Thích Minh Châu'>\n<title></title>\n</head>\n<body>\n<article id='sn12.32' lang='vi'>\n<header>\n<ul>\n<li class='division'>Chương 12: Tương Ưng Nhân Duyên</li>\n<li>IV: Phẩm Sát-đế-lỵ <i lang='pli' translate='no'>Kaḷāra</i>: <i lang='pli' translate='no'>Kaḷārakhattiyavagga</i></li>\n</ul>\n<h1>12.32. <i lang='pli' translate='no'>Kaḷāra</i></h1>\n</header>\n<p><a class='pts' id='S.ii.50' href='#S.ii.50'></a><a class='ref vi-n' id='vi-n1' href='#vi-n1'>Vi-n 1</a> Trú ở <i lang='pli' translate='no'>Sāvatthī</i>.</p>\n<h2>I</h2>\n<p><a class='ref vi-n' id='vi-n2' href='#vi-n2'>Vi-n 2</a> Rồi Tỷ-kheo <i lang='pli' translate='no'>Kaḷāra</i> Khattiya (dòng Sát-đế-lỵ) đi đến Tôn giả <i lang='pli' translate='no'>Sāriputta</i>; sau khi đến, nói lên với Tôn giả <i lang='pli' translate='no'>Sāriputta</i> những lời chào đón hỏi thăm; sau khi nói lên những lời chào đón hỏi thăm thân hữu, liền ngồi xuống một bên.</p>\n<p><a class='ref vi-n' id='vi-n3' href='#vi-n3'>Vi-n 3</a> Ngồi xuống một bên, Tỷ-kheo <i lang='pli' translate='no'>Kaḷāra</i> Khattiya nói với Tôn giả <i lang='pli' translate='no'>Sāriputta</i>:</p>\n<p>—Này Hiền giả <i lang='pli' translate='no'>Sāriputta</i>, Tỷ-kheo <i lang='pli' translate='no'>Moḷiyaphagguṇa</i> đã từ bỏ học tập và hoàn tục.</p>\n<p>—Vậy vị Tôn giả ấy, không tìm được sự an ủi trong Pháp và Luật này?</p>\n<p><a class='ref vi-n' id='vi-n4' href='#vi-n4'>Vi-n 4</a> —Vậy Tôn giả <i lang='pli' translate='no'>Sāriputta</i> đã đạt được sự an ủi trong Pháp và Luật này?</p>\n<p>—Này Hiền giả, tôi không có nghi ngờ gì!</p>\n<p><a class='ref vi-n' id='vi-n5' href='#vi-n5'>Vi-n 5</a> —Này Hiền giả, còn đối với tương lai?</p>\n<p>—Tôi không có băn khoăn, này Hiền giả.</p>\n<p><a class='ref vi-n' id='vi-n6' href='#vi-n6'>Vi-n 6</a> Rồi Tỷ-kheo <i lang='pli' translate='no'>Kaḷāra</i> Khattiya từ chỗ ngồi đứng dậy, đi đến Thế Tôn; sau khi đến, đảnh lễ Thế Tôn rồi ngồi xuống một bên.</p>\n<p><a class='ref vi-n' id='vi-n7' href='#vi-n7'>Vi-n 7</a> Ngồi xuống một bên, Tỷ-kheo <i lang='pli' translate='no'>Kaḷāra</i> Khattiya bạch Thế Tôn:</p>\n<p>—Con được biết, bạch Thế Tôn, Tôn giả <i lang='pli' translate='no'>Sāriputta</i> tuyên bố được chánh trí như sau: “Sanh đã tận; Phạm hạnh đã thành, những việc nên làm đã làm; không còn trở lại trạng thái này nữa”.</p>\n<p><a class='ref vi-n' id='vi-n8' href='#vi-n8'>Vi-n 8</a> Rồi Thế Tôn gọi một Tỷ-kheo:</p>\n<p>—Này Tỷ-kheo, hãy đi và nhân danh Ta, gọi <i lang='pli' translate='no'>Sāriputta</i>: “Hiền giả <i lang='pli' translate='no'>Sāriputta</i>, bậc Ðạo Sư gọi Hiền giả”.</p>\n<p><a class='ref vi-n' id='vi-n9' href='#vi-n9'>Vi-n 9</a> —Thưa vâng, bạch Thế Tôn.</p>\n<p>Tỷ-kheo ấy vâng đáp Thế Tôn, đi đến Tôn giả <i lang='pli' translate='no'>Sāriputta</i>; sau khi đến, nói với Tôn giả <i lang='pli' translate='no'>Sāriputta</i>: “Bậc Ðạo Sư cho gọi Hiền giả”.</p>\n<p><a class='ref vi-n' id='vi-n10' href='#vi-n10'>Vi-n 10</a> —Thưa vâng, Hiền giả.</p>\n<p>Tôn giả <i lang='pli' translate='no'>Sāriputta</i> vâng đáp Tỷ-kheo ấy, đi đến Thế Tôn; sau khi đến, đảnh lễ Thế Tôn rồi ngồi xuống một bên.</p>\n<h2>II</h2>\n<p><a class='ref vi-n' id='vi-n11' href='#vi-n11'>Vi-n 11</a> Thế Tôn nói với Tôn giả <i lang='pli' translate='no'>Sāriputta</i> đang ngồi một bên:</p>\n<p>—Này <i lang='pli' translate='no'>Sāriputta</i>, có đúng sự thật chăng là ông có tuyên bố đã chứng được chánh trí: “Sanh đã tận, Phạm hạnh đã thành, những gì nên làm đã làm, không còn trở lui trạng thái này nữa”?</p>\n<p>—Bạch Thế Tôn, không phải với những câu ấy, với những chữ ấy, ý nghĩa ấy được con nói đến như vậy.</p>\n<p><a class='ref vi-n' id='vi-n12' href='#vi-n12'>Vi-n 12</a> —Vậy với pháp môn nào, này <i lang='pli' translate='no'>Sāriputta</i>, Thiện nam tử nói đến sự chứng đắc trí, lời tuyên bố cần phải được xem đúng như lời tuyên bố.</p>\n<p><a class='ref vi-n' id='vi-n13' href='#vi-n13'>Vi-n 13</a> —Bạch Thế Tôn, chính con đã nói như sau: “Bạch Thế Tôn, không phải với những câu ấy, với những chữ ấy, ý nghĩa ấy được con nói đến như vậy”.</p>\n<p><a class='ref vi-n' id='vi-n14' href='#vi-n14'>Vi-n 14</a> —Nếu họ có hỏi ông, này <i lang='pli' translate='no'>Sāriputta</i>: “ông biết như thế nào, này <i lang='pli' translate='no'>Sāriputta</i>, ông thấy như thế nào mà ông tuyên bố trí đã được chứng đắc: 'Ta biết sanh đã tận, Phạm hạnh đã thành, những gì nên làm đã làm, không còn trở lui lại trạng thái này nữa?'” Ðược hỏi vậy, này <i lang='pli' translate='no'>Sāriputta</i>, ông trả lời như thế nào?</p>\n<p><a class='ref vi-n' id='vi-n15' href='#vi-n15'>Vi-n 15</a> —Nếu họ có hỏi con, bạch Thế Tôn: “Hiền giả biết như thế nào, này Hiền giả <i lang='pli' translate='no'>Sāriputta</i>, Hiền giả thấy như thế nào mà tuyên bố trí đã được chứng đắc: 'Ta đã biết, sanh đã tận, Phạm hạnh đã thành, những gì nên làm đã làm, không còn trở lại trạng thái này nữa?'” Ðược hỏi vậy, bạch Thế Tôn, con trả lời như sau:</p>\n<p><a class='ref vi-n' id='vi-n16' href='#vi-n16'>Vi-n 16</a> “Vì rằng này Hiền giả, trong (danh từ) tận diệt, ta hiểu được là sự tận diệt của nhân, chính do nhân ấy sanh sanh khởi. Sau khi hiểu được nghĩa tận diệt trong (danh từ) tận diệt, ta mới biết: 'Sanh đã tận, Phạm hạnh đã thành, những gì nên làm đã làm, không còn trở lui trạng thái này nữa.'”</p>\n<p>Ðược hỏi như vậy, bạch Thế Tôn, con trả lời như vậy.</p>\n<p><a class='ref vi-n' id='vi-n17' href='#vi-n17'>Vi-n 17</a> —Này <i lang='pli' translate='no'>Sāriputta</i>, nếu ông được hỏi: “Này Hiền giả <i lang='pli' translate='no'>Sāriputta</i>, sanh lấy gì làm nhân, lấy gì tập khởi, lấy gì tác sanh, lấy gì làm hiện hữu?” Ðược hỏi như vậy, này <i lang='pli' translate='no'>Sāriputta</i>, ông trả lời như thế nào?</p>\n<p><a class='ref vi-n' id='vi-n18' href='#vi-n18'>Vi-n 18</a> —Bạch Thế Tôn, nếu con được hỏi: “Này Hiền giả <i lang='pli' translate='no'>Sāriputta</i>, sanh lấy gì làm nhân… (như trên)… lấy gì làm hiện hữu?” Ðược hỏi vậy, bạch Thế Tôn, con trả lời như sau: “Sanh lấy hữu làm nhân, lấy hữu tập khởi, lấy hữu tác sanh, lấy hữu làm hiện hữu”. Ðược hỏi vậy, bạch Thế Tôn, con trả lời như vậy.</p>\n<p><a class='ref vi-n' id='vi-n19' href='#vi-n19'>Vi-n 19</a> —Này <i lang='pli' translate='no'>Sāriputta</i>, nếu ông được hỏi: “Này Hiền giả <i lang='pli' translate='no'>Sāriputta</i>, hữu lấy gì làm nhân, lấy gì tập khởi, lấy gì tác sanh, lấy gì làm hiện hữu?” Ðược hỏi vậy này <i lang='pli' translate='no'>Sāriputta</i>, ông trả lời như thế nào?</p>\n<p><a class='ref vi-n' id='vi-n20' href='#vi-n20'>Vi-n 20</a> —Bạch Thế Tôn, nếu con được hỏi: “Này Hiền giả <i lang='pli' translate='no'>Sāriputta</i>, hữu lấy gì làm nhân… lấy gì làm hiện hữu?” Ðược hỏi vậy, bạch Thế Tôn, con trả lời như sau: “Hữu lấy thủ làm nhân, lấy thủ tập khởi, lấy thủ tác sanh, lấy thủ làm hiện hữu”. Ðược hỏi vậy, bạch Thế Tôn, con trả lời như vậy.</p>\n<p><a class='ref vi-n' id='vi-n21' href='#vi-n21'>Vi-n 21</a> —Này <i lang='pli' translate='no'>Sāriputta</i>, nếu ông được hỏi: “Này Hiền giả <i lang='pli' translate='no'>Sāriputta</i>, thủ lấy gì làm nhân… (như trên)…”</p>\n<p><a class='ref vi-n' id='vi-n22-23' href='#vi-n22-23'>Vi-n 22-23</a> —Và này <i lang='pli' translate='no'>Sāriputta</i>, nếu ông được hỏi: “Này Hiền giả <i lang='pli' translate='no'>Sāriputta</i>, ái lấy gì làm nhân, lấy gì tập khởi, lấy gì tác sanh, lấy gì làm hiện hữu?” Ðược hỏi vậy, này <i lang='pli' translate='no'>Sāriputta</i>, ông trả lời như thế nào?</p>\n<p><a class='ref vi-n' id='vi-n24' href='#vi-n24'>Vi-n 24</a> —Bạch Thế Tôn, nếu con được hỏi: “Này Hiền giả <i lang='pli' translate='no'>Sāriputta</i>, ái lấy gì làm nhân, lấy gì tập khởi, lấy gì tác sanh, lấy gì hiện hữu?”. Ðược hỏi vậy, bạch Thế Tôn, con sẽ trả lời như sau: “Này Hiền giả, ái lấy thọ làm nhân, lấy thọ tập khởi, lấy thọ tác sanh, lấy thọ làm hiện hữu”. Ðược hỏi vậy, bạch Thế Tôn, con trả lời như vậy.</p>\n<p><a class='ref vi-n' id='vi-n25' href='#vi-n25'>Vi-n 25</a> —Này <i lang='pli' translate='no'>Sāriputta</i>, nếu ông được hỏi: “Làm sao, này Hiền giả <i lang='pli' translate='no'>Sāriputta</i>, Hiền giả biết như thế nào, Hiền giả thấy như thế nào, cảm thọ diệu lạc ấy không tồn tại?” Ðược hỏi vậy, này <i lang='pli' translate='no'>Sāriputta</i>, ông trả lời như thế nào?</p>\n<p><a class='ref vi-n' id='vi-n26' href='#vi-n26'>Vi-n 26</a> —Bạch Thế Tôn, nếu con được hỏi: “Này Hiền giả <i lang='pli' translate='no'>Sāriputta</i>, Hiền giả biết như thế nào, Hiền giả thấy như thế nào, cảm thọ diệu lạc không tồn tại?” Ðược hỏi vậy, bạch Thế Tôn, con trả lời như sau:</p>\n<p><a class='ref vi-n' id='vi-n27' href='#vi-n27'>Vi-n 27</a> “Này Hiền giả, có ba cảm thọ này. Thế nào là ba? Lạc thọ, khổ thọ, phi khổ phi lạc thọ. Này Hiền giả, ba cảm thọ này vô thường, khi biết được cái gì vô thường là khổ, thời cảm thọ diệu lạc ấy không tồn tại”.</p>\n<p>Ðược hỏi vậy, bạch Thế Tôn, con trả lời như vậy.</p>\n<p><a class='ref vi-n' id='vi-n28' href='#vi-n28'>Vi-n 28</a> —Lành thay, lành thay, này <i lang='pli' translate='no'>Sāriputta</i>! Pháp môn (phương tiện) này, này <i lang='pli' translate='no'>Sāriputta</i>, có thể trả lời tóm tắt như sau: Cái gì được cảm thọ, cái ấy nằm trong đau khổ.</p>\n<p><a class='ref vi-n' id='vi-n29' href='#vi-n29'>Vi-n 29</a> —Này <i lang='pli' translate='no'>Sāriputta</i>, nếu ông được hỏi: “Hiền giả được giải thoát như thế nào, này Hiền giả <i lang='pli' translate='no'>Sāriputta</i>, mà Hiền giả tuyên bố trí đã được chứng đắc: 'Ta biết: Sanh đã tận, Phạm hạnh đã thành, các việc nên làm đã làm, không còn trở lui trạng thái này nữa'?” Ðược hỏi vậy, này <i lang='pli' translate='no'>Sāriputta</i>, ông trả lời như thế nào?</p>\n<p><a class='ref vi-n' id='vi-n30' href='#vi-n30'>Vi-n 30</a> —Bạch Thế Tôn, nếu con được hỏi: “Hiền giả được giải thoát như thế nào, này Hiền giả <i lang='pli' translate='no'>Sāriputta</i>, mà Hiền giả tuyên bố trí đã được chứng đắc: 'Ta biết: Sanh đã tận, Phạm hạnh đã thành, các việc nên làm đã làm, không còn trở lui trạng thái này nữa'?” Ðược hỏi vậy, bạch Thế Tôn, con trả lời như sau:</p>\n<p><a class='ref vi-n' id='vi-n31' href='#vi-n31'>Vi-n 31</a> “Do tự giải thoát, chư Hiền giả, do đoạn diệt tất cả chấp thủ, ta sống an trú chánh niệm như vậy. Nhờ sống an trú chánh niệm như vậy, các lậu hoặc không còn tiếp tục rỉ chảy, và ta không chấp nhận tự ngã”.</p>\n<p>Ðược hỏi vậy, bạch Thế Tôn, con trả lời như vậy.</p>\n<p><a class='ref vi-n' id='vi-n32' href='#vi-n32'>Vi-n 32</a> —Lành thay, lành thay, này <i lang='pli' translate='no'>Sāriputta</i>! Pháp môn (phương tiện) này, này <i lang='pli' translate='no'>Sāriputta</i>, có thể trả lời tóm tắt như sau: Những cái gì được vị Sa-môn gọi là lậu hoặc, ta không còn nghi ngờ gì nữa, chúng đã được ta diệt tận. Ta không còn phân vân gì nữa.</p>\n<p><a class='ref vi-n' id='vi-n33' href='#vi-n33'>Vi-n 33</a> Nói vậy xong, Thế Tôn từ chỗ ngồi đứng dậy đi vào tịnh xá.</p>\n<h2>III</h2>\n<p><a class='ref vi-n' id='vi-n34' href='#vi-n34'>Vi-n 34</a> Rồi Tôn giả <i lang='pli' translate='no'>Sāriputta</i>, sau khi Thế Tôn đi chẳng bao lâu, liền bảo các Tỷ-kheo:</p>\n<p><a class='ref vi-n' id='vi-n35' href='#vi-n35'>Vi-n 35</a> —Này chư Hiền giả, Thế Tôn hỏi ta câu hỏi thứ nhất mà ta chưa được biết trước, lúc ấy trí ta còn chậm chạp. Nhưng này chư Hiền giả, khi Thế Tôn tùy hỷ trả lời câu hỏi thứ nhất của ta, ta suy nghĩ như sau:</p>\n<p><a class='ref vi-n' id='vi-n36' href='#vi-n36'>Vi-n 36</a> “Nếu Thế Tôn hỏi ta ý nghĩa trọn ngày với những văn cú sai khác, với những pháp môn (phương tiện) sai khác, thời ta có thể trả lời Thế Tôn về ý nghĩa ấy cho đến trọn ngày với những văn cú sai khác, với những pháp môn sai khác.</p>\n<p><a class='ref vi-n' id='vi-n37' href='#vi-n37'>Vi-n 37</a> Nếu Thế Tôn hỏi ta ý nghĩa trọn đêm với những văn cú sai khác, với những pháp môn (phương tiện) sai khác, thời ta có thể trả lời Thế Tôn về ý nghĩa ấy cho đến trọn đêm với những văn cú sai khác, với những pháp môn (phương tiện) sai khác.</p>\n<p><a class='ref vi-n' id='vi-n38' href='#vi-n38'>Vi-n 38</a> Nếu Thế Tôn hỏi ta ý nghĩa trọn đêm và trọn ngày với những văn cú sai khác, với những pháp môn (phương tiện) sai khác, thời ta có thể trả lời Thế Tôn về ý nghĩa ấy cho đến trọn đêm và trọn ngày với những văn cú sai khác, với những pháp môn (phương tiện) sai khác.</p>\n<p><a class='ref vi-n' id='vi-n39' href='#vi-n39'>Vi-n 39</a> Nếu Thế Tôn hỏi ta ý nghĩa này trọn hai đêm hai ngày, ta có thể trả lời Thế Tôn về ý nghĩa ấy trọn hai đêm hai ngày.</p>\n<p><a class='ref vi-n' id='vi-n40' href='#vi-n40'>Vi-n 40</a> Nếu Thế Tôn hỏi ta ý nghĩa này trọn ba đêm ba ngày, ta có thể trả lời Thế Tôn về ý nghĩa ấy trọn ba đêm ba ngày.</p>\n<p><a class='ref vi-n' id='vi-n41' href='#vi-n41'>Vi-n 41</a> Nếu Thế Tôn hỏi ta ý nghĩa này trọn bốn đêm bốn ngày, ta có thể trả lời Thế Tôn về ý nghĩa ấy trọn bốn đêm bốn ngày.</p>\n<p><a class='ref vi-n' id='vi-n42' href='#vi-n42'>Vi-n 42</a> Nếu Thế Tôn hỏi ta ý nghĩa này trọn năm đêm năm ngày, ta có thể trả lời Thế Tôn về ý nghĩa này trọn năm đêm năm ngày.</p>\n<p><a class='ref vi-n' id='vi-n43' href='#vi-n43'>Vi-n 43</a> Nếu Thế Tôn hỏi ta ý nghĩa này trọn sáu đêm sáu ngày, ta có thể trả lời Thế Tôn về ý nghĩa này trọn sáu đêm sáu ngày.</p>\n<p><a class='ref vi-n' id='vi-n44' href='#vi-n44'>Vi-n 44</a> Nếu Thế Tôn hỏi ta ý nghĩa này trọn bảy đêm bảy ngày với những văn cú sai khác, với những pháp môn (phương tiện) sai khác, ta có thể trả lời Thế Tôn về ý nghĩa này trọn bảy đêm bảy ngày với những văn cú sai khác, với những pháp môn (phương tiện) sai khác”.</p>\n<h2>IV</h2>\n<p><a class='ref vi-n' id='vi-n45' href='#vi-n45'>Vi-n 45</a> Rồi Tỷ-kheo <i lang='pli' translate='no'>Kaḷāra</i> Khattiya từ chỗ ngồi đứng dậy, đi đến Thế Tôn, sau khi đến đảnh lễ Thế Tôn rồi ngồi xuống một bên.</p>\n<p><a class='ref vi-n' id='vi-n46' href='#vi-n46'>Vi-n 46</a> Ngồi xuống một bên, Tỷ-kheo <i lang='pli' translate='no'>Kaḷāra</i> Khattiya bạch Thế Tôn:</p>\n<p>—Bạch Thế Tôn, Tôn giả <i lang='pli' translate='no'>Sāriputta</i> đã rống lên tiếng rống con sư tử như sau: Này chư Hiền giả, Thế Tôn hỏi ta câu hỏi thứ nhất, mà ta chưa được biết trước, lúc ấy trí ta còn chậm chạp. Nhưng này chư Hiền giả, khi Thế Tôn tùy hỷ trả lời câu hỏi thứ nhất của ta, ta suy nghĩ như sau: “Nếu Thế Tôn hỏi ta về ý nghĩa này trọn ngày với những văn cú sai khác, với những phương tiện sai khác, ta có thể trả lời Thế Tôn về ý nghĩa ấy cho đến trọn ngày với những văn cú sai khác, với những pháp môn sai khác. Nếu Thế Tôn hỏi ta về ý nghĩa này cho đến trọn đêm… cho đến trọn đêm và trọn ngày… cho đến trọn ba… trọn bốn…, cho đến trọn năm… trọn sáu… trọn bảy đêm bảy ngày với những văn cú sai khác, với những phương tiện sai khác”.</p>\n<p><a class='ref vi-n' id='vi-n47' href='#vi-n47'>Vi-n 47</a> —Này các Tỷ-kheo, pháp giới ấy (<i lang='pli' translate='no'>Dhammadhātu</i>) được <i lang='pli' translate='no'>Sāriputta</i> khéo thành đạt. Do khéo thành đạt pháp giới ấy, nếu Ta hỏi <i lang='pli' translate='no'>Sāriputta</i> về ý nghĩa này trọn ngày với những văn cú sai khác, với những phương tiện sai khác, thời <i lang='pli' translate='no'>Sāriputta</i> có thể trả lời Ta về ý nghĩa này cho đến trọn ngày, với những văn cú sai khác, với những phương tiện sai khác. Nếu Ta hỏi <i lang='pli' translate='no'>Sāriputta</i> về ý nghĩa này cho đến trọn đêm với những văn cú sai khác, với những phương tiện sai khác, thời <i lang='pli' translate='no'>Sāriputta</i> có thể trả lời Ta về ý nghĩa này cho đến trọn đêm với những văn cú sai khác, với những phương tiện sai khác. Nếu Ta hỏi <i lang='pli' translate='no'>Sāriputta</i> về ý nghĩa này cho đến trọn đêm và trọn ngày, <i lang='pli' translate='no'>Sāriputta</i> có thể trả lời Ta về ý nghĩa này cho đến trọn đêm và trọn ngày. Nếu Ta hỏi <i lang='pli' translate='no'>Sāriputta</i> về ý nghĩa này cho đến trọn cả hai đêm và hai ngày, <i lang='pli' translate='no'>Sāriputta</i> có thể trả lời Ta về ý nghĩa này cho đến trọn cả hai đêm hai ngày. Nếu Ta hỏi <i lang='pli' translate='no'>Sāriputta</i> về ý nghĩa này cho đến trọn cả ba đêm ba ngày, <i lang='pli' translate='no'>Sāriputta</i> có thể trả lời Ta về ý nghĩa này cho đến cả ba đêm ba ngày. Nếu Ta hỏi <i lang='pli' translate='no'>Sāriputta</i> về ý nghĩa này cho đến trọn bốn đêm bốn ngày, <i lang='pli' translate='no'>Sāriputta</i> có thể trả lời Ta về ý nghĩa này cho đến bốn đêm bốn ngày. Nếu Ta hỏi <i lang='pli' translate='no'>Sāriputta</i> về ý nghĩa này cho đến trọn năm đêm năm ngày, <i lang='pli' translate='no'>Sāriputta</i> có thể trả lời Ta về ý nghĩa này cho đến trọn năm đêm năm ngày. Nếu Ta hỏi <i lang='pli' translate='no'>Sāriputta</i> về ý nghĩa này cho đến trọn sáu đêm sáu ngày, <i lang='pli' translate='no'>Sāriputta</i> có thể trả lời Ta về ý nghĩa này cho đến trọn sáu đêm sáu ngày. Nếu Ta hỏi <i lang='pli' translate='no'>Sāriputta</i> về ý nghĩa này trọn bảy đêm bảy ngày với những văn cú sai khác, với những pháp môn sai khác, <i lang='pli' translate='no'>Sāriputta</i> có thể trả lời cho Ta về ý nghĩa ấy cho đến trọn bảy đêm bảy ngày với những văn cú sai khác, với những pháp môn sai khác.</p>\n<footer>\n<p>Bộ kinh đã được <span class='author'>Hòa thượng Thích Minh Châu</span> dịch sang Việt ngữ và Thiền viện Vạn Hạnh phát hành trong đầu thập niên <span class='publication-date'>1980</span>. Sau đó, trong chương trình phiên dịch và ấn hành Ðại tạng kinh Việt Nam, bộ kinh được tái bản năm 1993 và có số thứ tự từ 12 đến 16.</p>\n<p>Prepared for SuttaCentral by <span class='editor'>Ayya Vimala</span>.</p>\n</footer>\n</article>\n</body>\n</html>\n"
  },
  "translation": {
    "uid": "sn12.32",
    "lang": "vi",
    "is_root": false,
    "title": "Kaḷāra",
    "author": "Thích Minh Châu",
    "author_short": "Minh Châu",
    "author_uid": "minh_chau",
    "next": {
      "author_uid": "minh_chau",
      "lang": "vi",
      "name": "Grounds for Knowledge ",
      "uid": "sn12.33"
    },
    "previous": {
      "author_uid": "minh_chau",
      "lang": "vi",
      "name": "What Has Come to Be ",
      "uid": "sn12.31"
    },
    "text": "<!DOCTYPE html>\n<html>\n<head>\n<meta charset='UTF-8'>\n<meta name='author' content='Thích Minh Châu'>\n<title></title>\n</head>\n<body>\n<article id='sn12.32' lang='vi'>\n<header>\n<ul>\n<li class='division'>Chương 12: Tương Ưng Nhân Duyên</li>\n<li>IV: Phẩm Sát-đế-lỵ <i lang='pli' translate='no'>Kaḷāra</i>: <i lang='pli' translate='no'>Kaḷārakhattiyavagga</i></li>\n</ul>\n<h1>12.32. <i lang='pli' translate='no'>Kaḷāra</i></h1>\n</header>\n<p><a class='pts' id='S.ii.50' href='#S.ii.50'></a><a class='ref vi-n' id='vi-n1' href='#vi-n1'>Vi-n 1</a> Trú ở <i lang='pli' translate='no'>Sāvatthī</i>.</p>\n<h2>I</h2>\n<p><a class='ref vi-n' id='vi-n2' href='#vi-n2'>Vi-n 2</a> Rồi Tỷ-kheo <i lang='pli' translate='no'>Kaḷāra</i> Khattiya (dòng Sát-đế-lỵ) đi đến Tôn giả <i lang='pli' translate='no'>Sāriputta</i>; sau khi đến, nói lên với Tôn giả <i lang='pli' translate='no'>Sāriputta</i> những lời chào đón hỏi thăm; sau khi nói lên những lời chào đón hỏi thăm thân hữu, liền ngồi xuống một bên.</p>\n<p><a class='ref vi-n' id='vi-n3' href='#vi-n3'>Vi-n 3</a> Ngồi xuống một bên, Tỷ-kheo <i lang='pli' translate='no'>Kaḷāra</i> Khattiya nói với Tôn giả <i lang='pli' translate='no'>Sāriputta</i>:</p>\n<p>—Này Hiền giả <i lang='pli' translate='no'>Sāriputta</i>, Tỷ-kheo <i lang='pli' translate='no'>Moḷiyaphagguṇa</i> đã từ bỏ học tập và hoàn tục.</p>\n<p>—Vậy vị Tôn giả ấy, không tìm được sự an ủi trong Pháp và Luật này?</p>\n<p><a class='ref vi-n' id='vi-n4' href='#vi-n4'>Vi-n 4</a> —Vậy Tôn giả <i lang='pli' translate='no'>Sāriputta</i> đã đạt được sự an ủi trong Pháp và Luật này?</p>\n<p>—Này Hiền giả, tôi không có nghi ngờ gì!</p>\n<p><a class='ref vi-n' id='vi-n5' href='#vi-n5'>Vi-n 5</a> —Này Hiền giả, còn đối với tương lai?</p>\n<p>—Tôi không có băn khoăn, này Hiền giả.</p>\n<p><a class='ref vi-n' id='vi-n6' href='#vi-n6'>Vi-n 6</a> Rồi Tỷ-kheo <i lang='pli' translate='no'>Kaḷāra</i> Khattiya từ chỗ ngồi đứng dậy, đi đến Thế Tôn; sau khi đến, đảnh lễ Thế Tôn rồi ngồi xuống một bên.</p>\n<p><a class='ref vi-n' id='vi-n7' href='#vi-n7'>Vi-n 7</a> Ngồi xuống một bên, Tỷ-kheo <i lang='pli' translate='no'>Kaḷāra</i> Khattiya bạch Thế Tôn:</p>\n<p>—Con được biết, bạch Thế Tôn, Tôn giả <i lang='pli' translate='no'>Sāriputta</i> tuyên bố được chánh trí như sau: “Sanh đã tận; Phạm hạnh đã thành, những việc nên làm đã làm; không còn trở lại trạng thái này nữa”.</p>\n<p><a class='ref vi-n' id='vi-n8' href='#vi-n8'>Vi-n 8</a> Rồi Thế Tôn gọi một Tỷ-kheo:</p>\n<p>—Này Tỷ-kheo, hãy đi và nhân danh Ta, gọi <i lang='pli' translate='no'>Sāriputta</i>: “Hiền giả <i lang='pli' translate='no'>Sāriputta</i>, bậc Ðạo Sư gọi Hiền giả”.</p>\n<p><a class='ref vi-n' id='vi-n9' href='#vi-n9'>Vi-n 9</a> —Thưa vâng, bạch Thế Tôn.</p>\n<p>Tỷ-kheo ấy vâng đáp Thế Tôn, đi đến Tôn giả <i lang='pli' translate='no'>Sāriputta</i>; sau khi đến, nói với Tôn giả <i lang='pli' translate='no'>Sāriputta</i>: “Bậc Ðạo Sư cho gọi Hiền giả”.</p>\n<p><a class='ref vi-n' id='vi-n10' href='#vi-n10'>Vi-n 10</a> —Thưa vâng, Hiền giả.</p>\n<p>Tôn giả <i lang='pli' translate='no'>Sāriputta</i> vâng đáp Tỷ-kheo ấy, đi đến Thế Tôn; sau khi đến, đảnh lễ Thế Tôn rồi ngồi xuống một bên.</p>\n<h2>II</h2>\n<p><a class='ref vi-n' id='vi-n11' href='#vi-n11'>Vi-n 11</a> Thế Tôn nói với Tôn giả <i lang='pli' translate='no'>Sāriputta</i> đang ngồi một bên:</p>\n<p>—Này <i lang='pli' translate='no'>Sāriputta</i>, có đúng sự thật chăng là ông có tuyên bố đã chứng được chánh trí: “Sanh đã tận, Phạm hạnh đã thành, những gì nên làm đã làm, không còn trở lui trạng thái này nữa”?</p>\n<p>—Bạch Thế Tôn, không phải với những câu ấy, với những chữ ấy, ý nghĩa ấy được con nói đến như vậy.</p>\n<p><a class='ref vi-n' id='vi-n12' href='#vi-n12'>Vi-n 12</a> —Vậy với pháp môn nào, này <i lang='pli' translate='no'>Sāriputta</i>, Thiện nam tử nói đến sự chứng đắc trí, lời tuyên bố cần phải được xem đúng như lời tuyên bố.</p>\n<p><a class='ref vi-n' id='vi-n13' href='#vi-n13'>Vi-n 13</a> —Bạch Thế Tôn, chính con đã nói như sau: “Bạch Thế Tôn, không phải với những câu ấy, với những chữ ấy, ý nghĩa ấy được con nói đến như vậy”.</p>\n<p><a class='ref vi-n' id='vi-n14' href='#vi-n14'>Vi-n 14</a> —Nếu họ có hỏi ông, này <i lang='pli' translate='no'>Sāriputta</i>: “ông biết như thế nào, này <i lang='pli' translate='no'>Sāriputta</i>, ông thấy như thế nào mà ông tuyên bố trí đã được chứng đắc: 'Ta biết sanh đã tận, Phạm hạnh đã thành, những gì nên làm đã làm, không còn trở lui lại trạng thái này nữa?'” Ðược hỏi vậy, này <i lang='pli' translate='no'>Sāriputta</i>, ông trả lời như thế nào?</p>\n<p><a class='ref vi-n' id='vi-n15' href='#vi-n15'>Vi-n 15</a> —Nếu họ có hỏi con, bạch Thế Tôn: “Hiền giả biết như thế nào, này Hiền giả <i lang='pli' translate='no'>Sāriputta</i>, Hiền giả thấy như thế nào mà tuyên bố trí đã được chứng đắc: 'Ta đã biết, sanh đã tận, Phạm hạnh đã thành, những gì nên làm đã làm, không còn trở lại trạng thái này nữa?'” Ðược hỏi vậy, bạch Thế Tôn, con trả lời như sau:</p>\n<p><a class='ref vi-n' id='vi-n16' href='#vi-n16'>Vi-n 16</a> “Vì rằng này Hiền giả, trong (danh từ) tận diệt, ta hiểu được là sự tận diệt của nhân, chính do nhân ấy sanh sanh khởi. Sau khi hiểu được nghĩa tận diệt trong (danh từ) tận diệt, ta mới biết: 'Sanh đã tận, Phạm hạnh đã thành, những gì nên làm đã làm, không còn trở lui trạng thái này nữa.'”</p>\n<p>Ðược hỏi như vậy, bạch Thế Tôn, con trả lời như vậy.</p>\n<p><a class='ref vi-n' id='vi-n17' href='#vi-n17'>Vi-n 17</a> —Này <i lang='pli' translate='no'>Sāriputta</i>, nếu ông được hỏi: “Này Hiền giả <i lang='pli' translate='no'>Sāriputta</i>, sanh lấy gì làm nhân, lấy gì tập khởi, lấy gì tác sanh, lấy gì làm hiện hữu?” Ðược hỏi như vậy, này <i lang='pli' translate='no'>Sāriputta</i>, ông trả lời như thế nào?</p>\n<p><a class='ref vi-n' id='vi-n18' href='#vi-n18'>Vi-n 18</a> —Bạch Thế Tôn, nếu con được hỏi: “Này Hiền giả <i lang='pli' translate='no'>Sāriputta</i>, sanh lấy gì làm nhân… (như trên)… lấy gì làm hiện hữu?” Ðược hỏi vậy, bạch Thế Tôn, con trả lời như sau: “Sanh lấy hữu làm nhân, lấy hữu tập khởi, lấy hữu tác sanh, lấy hữu làm hiện hữu”. Ðược hỏi vậy, bạch Thế Tôn, con trả lời như vậy.</p>\n<p><a class='ref vi-n' id='vi-n19' href='#vi-n19'>Vi-n 19</a> —Này <i lang='pli' translate='no'>Sāriputta</i>, nếu ông được hỏi: “Này Hiền giả <i lang='pli' translate='no'>Sāriputta</i>, hữu lấy gì làm nhân, lấy gì tập khởi, lấy gì tác sanh, lấy gì làm hiện hữu?” Ðược hỏi vậy này <i lang='pli' translate='no'>Sāriputta</i>, ông trả lời như thế nào?</p>\n<p><a class='ref vi-n' id='vi-n20' href='#vi-n20'>Vi-n 20</a> —Bạch Thế Tôn, nếu con được hỏi: “Này Hiền giả <i lang='pli' translate='no'>Sāriputta</i>, hữu lấy gì làm nhân… lấy gì làm hiện hữu?” Ðược hỏi vậy, bạch Thế Tôn, con trả lời như sau: “Hữu lấy thủ làm nhân, lấy thủ tập khởi, lấy thủ tác sanh, lấy thủ làm hiện hữu”. Ðược hỏi vậy, bạch Thế Tôn, con trả lời như vậy.</p>\n<p><a class='ref vi-n' id='vi-n21' href='#vi-n21'>Vi-n 21</a> —Này <i lang='pli' translate='no'>Sāriputta</i>, nếu ông được hỏi: “Này Hiền giả <i lang='pli' translate='no'>Sāriputta</i>, thủ lấy gì làm nhân… (như trên)…”</p>\n<p><a class='ref vi-n' id='vi-n22-23' href='#vi-n22-23'>Vi-n 22-23</a> —Và này <i lang='pli' translate='no'>Sāriputta</i>, nếu ông được hỏi: “Này Hiền giả <i lang='pli' translate='no'>Sāriputta</i>, ái lấy gì làm nhân, lấy gì tập khởi, lấy gì tác sanh, lấy gì làm hiện hữu?” Ðược hỏi vậy, này <i lang='pli' translate='no'>Sāriputta</i>, ông trả lời như thế nào?</p>\n<p><a class='ref vi-n' id='vi-n24' href='#vi-n24'>Vi-n 24</a> —Bạch Thế Tôn, nếu con được hỏi: “Này Hiền giả <i lang='pli' translate='no'>Sāriputta</i>, ái lấy gì làm nhân, lấy gì tập khởi, lấy gì tác sanh, lấy gì hiện hữu?”. Ðược hỏi vậy, bạch Thế Tôn, con sẽ trả lời như sau: “Này Hiền giả, ái lấy thọ làm nhân, lấy thọ tập khởi, lấy thọ tác sanh, lấy thọ làm hiện hữu”. Ðược hỏi vậy, bạch Thế Tôn, con trả lời như vậy.</p>\n<p><a class='ref vi-n' id='vi-n25' href='#vi-n25'>Vi-n 25</a> —Này <i lang='pli' translate='no'>Sāriputta</i>, nếu ông được hỏi: “Làm sao, này Hiền giả <i lang='pli' translate='no'>Sāriputta</i>, Hiền giả biết như thế nào, Hiền giả thấy như thế nào, cảm thọ diệu lạc ấy không tồn tại?” Ðược hỏi vậy, này <i lang='pli' translate='no'>Sāriputta</i>, ông trả lời như thế nào?</p>\n<p><a class='ref vi-n' id='vi-n26' href='#vi-n26'>Vi-n 26</a> —Bạch Thế Tôn, nếu con được hỏi: “Này Hiền giả <i lang='pli' translate='no'>Sāriputta</i>, Hiền giả biết như thế nào, Hiền giả thấy như thế nào, cảm thọ diệu lạc không tồn tại?” Ðược hỏi vậy, bạch Thế Tôn, con trả lời như sau:</p>\n<p><a class='ref vi-n' id='vi-n27' href='#vi-n27'>Vi-n 27</a> “Này Hiền giả, có ba cảm thọ này. Thế nào là ba? Lạc thọ, khổ thọ, phi khổ phi lạc thọ. Này Hiền giả, ba cảm thọ này vô thường, khi biết được cái gì vô thường là khổ, thời cảm thọ diệu lạc ấy không tồn tại”.</p>\n<p>Ðược hỏi vậy, bạch Thế Tôn, con trả lời như vậy.</p>\n<p><a class='ref vi-n' id='vi-n28' href='#vi-n28'>Vi-n 28</a> —Lành thay, lành thay, này <i lang='pli' translate='no'>Sāriputta</i>! Pháp môn (phương tiện) này, này <i lang='pli' translate='no'>Sāriputta</i>, có thể trả lời tóm tắt như sau: Cái gì được cảm thọ, cái ấy nằm trong đau khổ.</p>\n<p><a class='ref vi-n' id='vi-n29' href='#vi-n29'>Vi-n 29</a> —Này <i lang='pli' translate='no'>Sāriputta</i>, nếu ông được hỏi: “Hiền giả được giải thoát như thế nào, này Hiền giả <i lang='pli' translate='no'>Sāriputta</i>, mà Hiền giả tuyên bố trí đã được chứng đắc: 'Ta biết: Sanh đã tận, Phạm hạnh đã thành, các việc nên làm đã làm, không còn trở lui trạng thái này nữa'?” Ðược hỏi vậy, này <i lang='pli' translate='no'>Sāriputta</i>, ông trả lời như thế nào?</p>\n<p><a class='ref vi-n' id='vi-n30' href='#vi-n30'>Vi-n 30</a> —Bạch Thế Tôn, nếu con được hỏi: “Hiền giả được giải thoát như thế nào, này Hiền giả <i lang='pli' translate='no'>Sāriputta</i>, mà Hiền giả tuyên bố trí đã được chứng đắc: 'Ta biết: Sanh đã tận, Phạm hạnh đã thành, các việc nên làm đã làm, không còn trở lui trạng thái này nữa'?” Ðược hỏi vậy, bạch Thế Tôn, con trả lời như sau:</p>\n<p><a class='ref vi-n' id='vi-n31' href='#vi-n31'>Vi-n 31</a> “Do tự giải thoát, chư Hiền giả, do đoạn diệt tất cả chấp thủ, ta sống an trú chánh niệm như vậy. Nhờ sống an trú chánh niệm như vậy, các lậu hoặc không còn tiếp tục rỉ chảy, và ta không chấp nhận tự ngã”.</p>\n<p>Ðược hỏi vậy, bạch Thế Tôn, con trả lời như vậy.</p>\n<p><a class='ref vi-n' id='vi-n32' href='#vi-n32'>Vi-n 32</a> —Lành thay, lành thay, này <i lang='pli' translate='no'>Sāriputta</i>! Pháp môn (phương tiện) này, này <i lang='pli' translate='no'>Sāriputta</i>, có thể trả lời tóm tắt như sau: Những cái gì được vị Sa-môn gọi là lậu hoặc, ta không còn nghi ngờ gì nữa, chúng đã được ta diệt tận. Ta không còn phân vân gì nữa.</p>\n<p><a class='ref vi-n' id='vi-n33' href='#vi-n33'>Vi-n 33</a> Nói vậy xong, Thế Tôn từ chỗ ngồi đứng dậy đi vào tịnh xá.</p>\n<h2>III</h2>\n<p><a class='ref vi-n' id='vi-n34' href='#vi-n34'>Vi-n 34</a> Rồi Tôn giả <i lang='pli' translate='no'>Sāriputta</i>, sau khi Thế Tôn đi chẳng bao lâu, liền bảo các Tỷ-kheo:</p>\n<p><a class='ref vi-n' id='vi-n35' href='#vi-n35'>Vi-n 35</a> —Này chư Hiền giả, Thế Tôn hỏi ta câu hỏi thứ nhất mà ta chưa được biết trước, lúc ấy trí ta còn chậm chạp. Nhưng này chư Hiền giả, khi Thế Tôn tùy hỷ trả lời câu hỏi thứ nhất của ta, ta suy nghĩ như sau:</p>\n<p><a class='ref vi-n' id='vi-n36' href='#vi-n36'>Vi-n 36</a> “Nếu Thế Tôn hỏi ta ý nghĩa trọn ngày với những văn cú sai khác, với những pháp môn (phương tiện) sai khác, thời ta có thể trả lời Thế Tôn về ý nghĩa ấy cho đến trọn ngày với những văn cú sai khác, với những pháp môn sai khác.</p>\n<p><a class='ref vi-n' id='vi-n37' href='#vi-n37'>Vi-n 37</a> Nếu Thế Tôn hỏi ta ý nghĩa trọn đêm với những văn cú sai khác, với những pháp môn (phương tiện) sai khác, thời ta có thể trả lời Thế Tôn về ý nghĩa ấy cho đến trọn đêm với những văn cú sai khác, với những pháp môn (phương tiện) sai khác.</p>\n<p><a class='ref vi-n' id='vi-n38' href='#vi-n38'>Vi-n 38</a> Nếu Thế Tôn hỏi ta ý nghĩa trọn đêm và trọn ngày với những văn cú sai khác, với những pháp môn (phương tiện) sai khác, thời ta có thể trả lời Thế Tôn về ý nghĩa ấy cho đến trọn đêm và trọn ngày với những văn cú sai khác, với những pháp môn (phương tiện) sai khác.</p>\n<p><a class='ref vi-n' id='vi-n39' href='#vi-n39'>Vi-n 39</a> Nếu Thế Tôn hỏi ta ý nghĩa này trọn hai đêm hai ngày, ta có thể trả lời Thế Tôn về ý nghĩa ấy trọn hai đêm hai ngày.</p>\n<p><a class='ref vi-n' id='vi-n40' href='#vi-n40'>Vi-n 40</a> Nếu Thế Tôn hỏi ta ý nghĩa này trọn ba đêm ba ngày, ta có thể trả lời Thế Tôn về ý nghĩa ấy trọn ba đêm ba ngày.</p>\n<p><a class='ref vi-n' id='vi-n41' href='#vi-n41'>Vi-n 41</a> Nếu Thế Tôn hỏi ta ý nghĩa này trọn bốn đêm bốn ngày, ta có thể trả lời Thế Tôn về ý nghĩa ấy trọn bốn đêm bốn ngày.</p>\n<p><a class='ref vi-n' id='vi-n42' href='#vi-n42'>Vi-n 42</a> Nếu Thế Tôn hỏi ta ý nghĩa này trọn năm đêm năm ngày, ta có thể trả lời Thế Tôn về ý nghĩa này trọn năm đêm năm ngày.</p>\n<p><a class='ref vi-n' id='vi-n43' href='#vi-n43'>Vi-n 43</a> Nếu Thế Tôn hỏi ta ý nghĩa này trọn sáu đêm sáu ngày, ta có thể trả lời Thế Tôn về ý nghĩa này trọn sáu đêm sáu ngày.</p>\n<p><a class='ref vi-n' id='vi-n44' href='#vi-n44'>Vi-n 44</a> Nếu Thế Tôn hỏi ta ý nghĩa này trọn bảy đêm bảy ngày với những văn cú sai khác, với những pháp môn (phương tiện) sai khác, ta có thể trả lời Thế Tôn về ý nghĩa này trọn bảy đêm bảy ngày với những văn cú sai khác, với những pháp môn (phương tiện) sai khác”.</p>\n<h2>IV</h2>\n<p><a class='ref vi-n' id='vi-n45' href='#vi-n45'>Vi-n 45</a> Rồi Tỷ-kheo <i lang='pli' translate='no'>Kaḷāra</i> Khattiya từ chỗ ngồi đứng dậy, đi đến Thế Tôn, sau khi đến đảnh lễ Thế Tôn rồi ngồi xuống một bên.</p>\n<p><a class='ref vi-n' id='vi-n46' href='#vi-n46'>Vi-n 46</a> Ngồi xuống một bên, Tỷ-kheo <i lang='pli' translate='no'>Kaḷāra</i> Khattiya bạch Thế Tôn:</p>\n<p>—Bạch Thế Tôn, Tôn giả <i lang='pli' translate='no'>Sāriputta</i> đã rống lên tiếng rống con sư tử như sau: Này chư Hiền giả, Thế Tôn hỏi ta câu hỏi thứ nhất, mà ta chưa được biết trước, lúc ấy trí ta còn chậm chạp. Nhưng này chư Hiền giả, khi Thế Tôn tùy hỷ trả lời câu hỏi thứ nhất của ta, ta suy nghĩ như sau: “Nếu Thế Tôn hỏi ta về ý nghĩa này trọn ngày với những văn cú sai khác, với những phương tiện sai khác, ta có thể trả lời Thế Tôn về ý nghĩa ấy cho đến trọn ngày với những văn cú sai khác, với những pháp môn sai khác. Nếu Thế Tôn hỏi ta về ý nghĩa này cho đến trọn đêm… cho đến trọn đêm và trọn ngày… cho đến trọn ba… trọn bốn…, cho đến trọn năm… trọn sáu… trọn bảy đêm bảy ngày với những văn cú sai khác, với những phương tiện sai khác”.</p>\n<p><a class='ref vi-n' id='vi-n47' href='#vi-n47'>Vi-n 47</a> —Này các Tỷ-kheo, pháp giới ấy (<i lang='pli' translate='no'>Dhammadhātu</i>) được <i lang='pli' translate='no'>Sāriputta</i> khéo thành đạt. Do khéo thành đạt pháp giới ấy, nếu Ta hỏi <i lang='pli' translate='no'>Sāriputta</i> về ý nghĩa này trọn ngày với những văn cú sai khác, với những phương tiện sai khác, thời <i lang='pli' translate='no'>Sāriputta</i> có thể trả lời Ta về ý nghĩa này cho đến trọn ngày, với những văn cú sai khác, với những phương tiện sai khác. Nếu Ta hỏi <i lang='pli' translate='no'>Sāriputta</i> về ý nghĩa này cho đến trọn đêm với những văn cú sai khác, với những phương tiện sai khác, thời <i lang='pli' translate='no'>Sāriputta</i> có thể trả lời Ta về ý nghĩa này cho đến trọn đêm với những văn cú sai khác, với những phương tiện sai khác. Nếu Ta hỏi <i lang='pli' translate='no'>Sāriputta</i> về ý nghĩa này cho đến trọn đêm và trọn ngày, <i lang='pli' translate='no'>Sāriputta</i> có thể trả lời Ta về ý nghĩa này cho đến trọn đêm và trọn ngày. Nếu Ta hỏi <i lang='pli' translate='no'>Sāriputta</i> về ý nghĩa này cho đến trọn cả hai đêm và hai ngày, <i lang='pli' translate='no'>Sāriputta</i> có thể trả lời Ta về ý nghĩa này cho đến trọn cả hai đêm hai ngày. Nếu Ta hỏi <i lang='pli' translate='no'>Sāriputta</i> về ý nghĩa này cho đến trọn cả ba đêm ba ngày, <i lang='pli' translate='no'>Sāriputta</i> có thể trả lời Ta về ý nghĩa này cho đến cả ba đêm ba ngày. Nếu Ta hỏi <i lang='pli' translate='no'>Sāriputta</i> về ý nghĩa này cho đến trọn bốn đêm bốn ngày, <i lang='pli' translate='no'>Sāriputta</i> có thể trả lời Ta về ý nghĩa này cho đến bốn đêm bốn ngày. Nếu Ta hỏi <i lang='pli' translate='no'>Sāriputta</i> về ý nghĩa này cho đến trọn năm đêm năm ngày, <i lang='pli' translate='no'>Sāriputta</i> có thể trả lời Ta về ý nghĩa này cho đến trọn năm đêm năm ngày. Nếu Ta hỏi <i lang='pli' translate='no'>Sāriputta</i> về ý nghĩa này cho đến trọn sáu đêm sáu ngày, <i lang='pli' translate='no'>Sāriputta</i> có thể trả lời Ta về ý nghĩa này cho đến trọn sáu đêm sáu ngày. Nếu Ta hỏi <i lang='pli' translate='no'>Sāriputta</i> về ý nghĩa này trọn bảy đêm bảy ngày với những văn cú sai khác, với những pháp môn sai khác, <i lang='pli' translate='no'>Sāriputta</i> có thể trả lời cho Ta về ý nghĩa ấy cho đến trọn bảy đêm bảy ngày với những văn cú sai khác, với những pháp môn sai khác.</p>\n<footer>\n<p>Bộ kinh đã được <span class='author'>Hòa thượng Thích Minh Châu</span> dịch sang Việt ngữ và Thiền viện Vạn Hạnh phát hành trong đầu thập niên <span class='publication-date'>1980</span>. Sau đó, trong chương trình phiên dịch và ấn hành Ðại tạng kinh Việt Nam, bộ kinh được tái bản năm 1993 và có số thứ tự từ 12 đến 16.</p>\n<p>Prepared for SuttaCentral by <span class='editor'>Ayya Vimala</span>.</p>\n</footer>\n</article>\n</body>\n</html>\n"
  },
  "segmented": false,
  "suttaplex": {
    "acronym": "SN 12.32",
    "volpages": " PTS 2.51, PTS 2.52, PTS 2.53, PTS 2.54, PTS 2.55, PTS 2.56",
    "alt_volpages": null,
    "uid": "sn12.32",
    "blurb": "A mendicant named Kaḷāra the Khattiya informs Sāriputta that the mendicant Moḷiyaphagguna had disrobed. Overinterpreting Sāriputta’s reply, Kaḷāra reports to the Buddha that Sāriputta had claimed to have ended all defilements. The Buddha calls Sāriputta to clarify his statements, and Sāriputta explains in terms of dependent origination.",
    "difficulty": null,
    "original_title": "Kaḷārasutta",
    "root_lang": "pli",
    "root_lang_name": "Pāli",
    "type": "leaf",
    "from": null,
    "translated_title": "Kaḷāra",
    "translations": [
      {
        "lang": "de",
        "lang_name": "Deutsch",
        "is_root": false,
        "author": "Sabbamitta",
        "author_short": "sabbamitta",
        "author_uid": "sabbamitta",
        "publication_date": "2019",
        "id": "sn12.32_translation-de-sabbamitta",
        "segmented": true,
        "title": "Mit Kaḷāra dem Adligen ",
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "en",
        "lang_name": "English",
        "is_root": false,
        "author": "Bhikkhu Sujato",
        "author_short": "sujato",
        "author_uid": "sujato",
        "publication_date": "2018",
        "id": "sn12.32_translation-en-sujato",
        "segmented": true,
        "title": "With Kaḷāra the Aristocrat ",
        "volpage": null,
        "has_comment": true
      },
      {
        "lang": "pli",
        "lang_name": "Pāli",
        "is_root": true,
        "author": "Mahāsaṅgīti Tipiṭaka Buddhavasse 2500",
        "author_short": "ms",
        "author_uid": "ms",
        "publication_date": null,
        "id": "sn12.32_root-pli-ms",
        "segmented": true,
        "title": null,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "sr",
        "lang_name": "Srpski",
        "is_root": false,
        "author": "Branislav Kovačević",
        "author_short": "brankokovacevic",
        "author_uid": "brankokovacevic",
        "publication_date": "2023",
        "id": "sn12.32_translation-sr-brankokovacevic",
        "segmented": true,
        "title": "Kaḷāra ",
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "bn",
        "lang_name": "বাংলা",
        "is_root": false,
        "author": "ইন্দ্রগুপ্ত ভিক্ষু, বঙ্গীস ভিক্ষু, অজিত ভিক্ষু",
        "author_short": "ইন্দ্রগুপ্ত …",
        "author_uid": "indragupta-bangish-ajit",
        "publication_date": "2018",
        "id": "bn_sn12.32_indragupta-bangish-ajit",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "cs",
        "lang_name": "Čeština",
        "is_root": false,
        "author": "Bhikkhu Gavésakó, Štěpán Chromovský",
        "author_short": "Gavésakó …",
        "author_uid": "gavesako-chromovsky",
        "publication_date": null,
        "id": "cs_sn12.32_gavesako-chromovsky",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "de",
        "lang_name": "Deutsch",
        "is_root": false,
        "author": "Wilhelm Geiger",
        "author_short": "Geiger",
        "author_uid": "geiger",
        "publication_date": "1925",
        "id": "de_sn12.32_geiger",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "en",
        "lang_name": "English",
        "is_root": false,
        "author": "Bhikkhu Bodhi",
        "author_short": "Bodhi",
        "author_uid": "bodhi",
        "publication_date": "2000",
        "id": "en_sn12.32_bodhi",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "es",
        "lang_name": "Español",
        "is_root": false,
        "author": "Anton P. Baron",
        "author_short": "Baron",
        "author_uid": "baron",
        "publication_date": "2011",
        "id": "es_sn12.32_baron",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "id",
        "lang_name": "Bahasa Indonesia",
        "is_root": false,
        "author": "Indra Anggara",
        "author_short": "Anggara",
        "author_uid": "anggara",
        "publication_date": null,
        "id": "id_sn12.32_anggara",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "jpn",
        "lang_name": "日本語",
        "is_root": false,
        "author": "関西パーリ語実習会",
        "author_short": "関西パーリ語実習会",
        "author_uid": "kansai",
        "publication_date": "2023",
        "id": "jpn_sn12.32_kansai",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "my",
        "lang_name": "မြန်မာဘာသာ",
        "is_root": false,
        "author": "Pitaka Myanmar Translation",
        "author_short": "PMT",
        "author_uid": "pmt",
        "publication_date": null,
        "id": "my_sn12.32_pmt",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "no",
        "lang_name": "Norsk",
        "is_root": false,
        "author": "Kåre A. Lie",
        "author_short": "Lie",
        "author_uid": "lie",
        "publication_date": "2016",
        "id": "no_sn12.32_lie",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "pt",
        "lang_name": "Português",
        "is_root": false,
        "author": "Michael Beisert",
        "author_short": "Beisert",
        "author_uid": "beisert",
        "publication_date": "2013",
        "id": "pt_sn12.32_beisert",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "ru",
        "lang_name": "Русский",
        "is_root": false,
        "author": "SV",
        "author_short": "SV",
        "author_uid": "sv",
        "publication_date": "2015",
        "id": "ru_sn12.32_sv",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "si",
        "lang_name": "සිංහල",
        "is_root": false,
        "author": "A.P. de Zoysa",
        "author_short": "Zoysa",
        "author_uid": "zoysa",
        "publication_date": null,
        "id": "si_sn12.32_zoysa",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "th",
        "lang_name": "ไทย",
        "is_root": false,
        "author": "Siam Rath",
        "author_short": "Siam Rath",
        "author_uid": "siam_rath",
        "publication_date": null,
        "id": "th_sn12.32_siam_rath",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "author": "Thích Minh Châu",
        "author_short": "Minh Châu",
        "author_uid": "minh_chau",
        "has_comment": false,
        "id": "vi_sn12.32_minh_chau",
        "is_root": false,
        "lang": "vi",
        "lang_name": "Tiếng Việt",
        "publication_date": "1980",
        "segmented": false,
        "volpage": null,
        "title": "Kaḷāra"
      },
      {
        "lang": "zh",
        "lang_name": "汉语",
        "is_root": false,
        "author": "莊春江",
        "author_short": "莊春江",
        "author_uid": "zhuang",
        "publication_date": null,
        "id": "zh_sn12.32_zhuang",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      }
    ],
    "parallel_count": 3,
    "biblio": null,
    "priority_author_uid": null,
    "verseNo": "ms12S2_222, msdiv32, vri24.45,ms12S2_223,ms12S2_224, ndp13.44,ms12S2_225,cck16.47, ms12S2_226, pts-vp-pli2.51, sya16.60,bj14.80, csp1ed12.284, csp2ed12.284, dr16.60, ms12S2_227, vri24.46,dr16.61, ms12S2_228, sya16.61,cck16.48, ms12S2_229, ndp13.45, pts-vp-pli2.52,csp1ed12.285, csp2ed12.285, ms12S2_230,dr16.62, ms12S2_231, sya16.62,bj14.82, cck16.49, ms12S2_232, pts-vp-pli2.53, vri24.47,dr16.63, ms12S2_233, ndp13.46, sya16.63,bj14.84, ms12S2_234,cck16.50, csp1ed12.286, csp2ed12.286, dr16.64, ms12S2_235, pts-vp-pli2.54, sya16.64,ms12S2_236, vri24.48,bj14.86, cck16.51, csp1ed12.287, csp2ed12.287, dr16.65, ms12S2_237, ndp13.47, pts-vp-pli2.55, sya16.65,cck16.52, dr16.66, ms12S2_238, ndp13.48, pts-vp-pli2.56, sya16.66, vri24.49,bj14.88, csp1ed12.288, csp2ed12.288, dr16.67, ms12S2_239, sya16.67",
    "previous": {
      "name": null,
      "uid": null
    },
    "next": {
      "name": null,
      "uid": null
    }
  },
  "bilara_root_text": {
    "uid": "sn12.32",
    "author": "Mahāsaṅgīti Tipiṭaka Buddhavasse 2500",
    "author_short": "ms",
    "author_uid": "ms",
    "lang": "pli",
    "title": "Kaḷārasutta",
    "previous": {
      "author_uid": "ms",
      "lang": "pli",
      "name": null,
      "uid": null
    },
    "next": {
      "author_uid": "ms",
      "lang": "pli",
      "name": null,
      "uid": null
    }
  },
  "bilara_translated_text": null,
  "candidate_authors": [
    "sujato",
    "bodhi"
  ]
}