{
  "root_text": {
    "uid": "sn46.51",
    "lang": "vi",
    "is_root": false,
    "title": "Ðồ Ăn",
    "author": "Thích Minh Châu",
    "author_short": "Minh Châu",
    "author_uid": "minh_chau",
    "next": {
      "author_uid": "minh_chau",
      "lang": "vi",
      "name": "Is There a Way? ",
      "uid": "sn46.52"
    },
    "previous": {
      "author_uid": "minh_chau",
      "lang": "vi",
      "name": "Exterior ",
      "uid": "sn46.50"
    },
    "text": "<!DOCTYPE html>\n<html>\n<head>\n<meta charset='UTF-8'>\n<meta name='author' content='Thích Minh Châu'>\n<title></title>\n</head>\n<body>\n<article id='sn46.51' lang='vi'>\n<header>\n<ul>\n<li class='division'>Chương 46: Tương Ưng Giác Chi</li>\n<li>VI: Phẩm Tổng Nhiếp Giác Chi</li>\n</ul>\n<h1>46.51. Ðồ Ăn</h1>\n</header>\n<p><a class='ref vi-n' id='vi-n1' href='#vi-n1'>Vi-n 1</a> Tất cả nhân duyên ở <i lang='pli' translate='no'>Sāvatthi</i> …</p>\n<p><a class='pts' id='S.v,102' href='#S.v,102'></a><a class='vnO' id='Tạp.27,.4,.Ðại.2,192a'></a><a class='ref vi-n' id='vi-n2' href='#vi-n2'>Vi-n 2</a> …</p>\n<p><a class='ref vi-n' id='vi-n3' href='#vi-n3'>Vi-n 3</a> —Ta sẽ giảng cho các Ông, này các Tỷ-kheo, các món ăn và không phải món ăn của năm triền cái và bảy giác chi. Hãy lắng nghe.</p>\n<h2>Món Ăn Của Các Triền Cái</h2>\n<p><a class='ref vi-n' id='vi-n4' href='#vi-n4'>Vi-n 4</a> —Cái gì là món ăn, này các Tỷ-kheo, khiến cho dục tham (kàmacchanda) chưa sanh được sanh khởi; hay dục tham đã sanh được tăng trưởng, quảng đại? Có tịnh tướng, này các Tỷ-kheo. Ở đây, nếu phi như lý tác ý được làm cho sung mãn, thời chính cái này là món ăn khiến cho dục tham chưa sanh được sanh khởi, hay dục tham đã sanh được tăng trưởng, quảng đại.</p>\n<p><a class='ref vi-n' id='vi-n5' href='#vi-n5'>Vi-n 5</a> Cái gì là món ăn, này các Tỷ-kheo, khiến cho sân chưa sanh được sanh khởi; hay sân đã sanh được tăng trưởng, quảng đại? Có chướng ngại tướng (patighanimittam), này các Tỷ-kheo. Ở đây, nếu phi như lý tác ý được làm cho sung mãn, thời chính cái này là món ăn khiến cho sân chưa sanh được sanh khởi, hay sân đã sanh được tăng trưởng, quảng đại.</p>\n<p><a class='ref vi-n' id='vi-n6' href='#vi-n6'>Vi-n 6</a> Cái gì là món ăn, này các Tỷ-kheo, khiến cho hôn trầm thụy miên chưa sanh được sanh khởi; hay hôn trầm thụy miên đã sanh được tăng trưởng, quảng đại? Không hân hoan, biếng nhác, chán nản, ăn quá no, tâm uể oải. Ở đây, nếu phi như lý tác ý được làm cho sung mãn, thời chính cái này là món ăn khiến cho hôn trầm thụy miên chưa sanh được sanh khởi, hay hôn trầm thụy miên đã sanh được tăng trưởng, quảng đại.</p>\n<p><a class='ref vi-n' id='vi-n7' href='#vi-n7'>Vi-n 7</a> Cái gì là món ăn, này các Tỷ-kheo, khiến cho trạo hối chưa sanh được sanh khởi, hay trạo hối đã sanh được tăng trưởng, quảng đại? Có tâm chưa được chỉ tịnh, này các Tỷ-kheo. Ở đây, nếu phi như lý tác ý được làm cho sung mãn, thời chính cái này là món ăn khiến cho trạo hối chưa sanh được sanh khởi, hay trạo hối đã sanh được tăng trưởng, quảng đại.</p>\n<p><a class='ref vi-n' id='vi-n8' href='#vi-n8'>Vi-n 8</a> Cái gì là món ăn, này các Tỷ-kheo, khiến cho nghi hoặc chưa sanh được sanh khởi, hay nghi hoặc đã sanh được tăng trưởng, quảng đại? Có các pháp trú xứ của nghi hoặc. Ở đây, nếu phi như lý tác ý được làm cho sung mãn, thời chính cái này là món ăn khiến cho nghi hoặc chưa sanh được sanh khởi, hay nghi hoặc đã sanh được tăng trưởng, quảng đại.</p>\n<h2>Món Ăn Cho Các Giác Chi</h2>\n<p><a class='ref vi-n' id='vi-n9' href='#vi-n9'>Vi-n 9</a> —Cái gì là món ăn, này các Tỷ-kheo, khiến cho niệm giác chi chưa sanh được sanh khởi, hay niệm giác chi đã sanh được tu tập, được làm cho viên mãn? Này các Tỷ-kheo, có các pháp trú xứ cho niệm giác chi. Ở đây, nếu như lý tác ý được làm cho sung mãn, thời chính cái này là món ăn khiến cho niệm giác chi chưa sanh được sanh khởi, hay niệm giác chi đã sanh được tu tập, làm cho viên mãn.</p>\n<p><a class='ref vi-n' id='vi-n10' href='#vi-n10'>Vi-n 10</a> Và này các Tỷ-kheo, cái gì là món ăn khiến cho trạch pháp giác chi chưa sanh được sanh khởi, hay trạch pháp giác chi đã sanh được tu tập, được làm cho viên mãn? Có những pháp thiện và bất thiện, này các Tỷ-kheo, có những pháp có tội và không có tội, có những pháp liệt và thắng, có những pháp dự phần đen và trắng. Ở đây, nếu như lý tác ý được làm cho sung mãn, thời chính cái này là món ăn khiến cho trạch pháp giác chi chưa sanh được sanh khởi, hay trạch pháp giác chi đã sanh được tu tập, được làm cho viên mãn.</p>\n<p><a class='ref vi-n' id='vi-n11' href='#vi-n11'>Vi-n 11</a> Và này các Tỷ-kheo, cái gì là món ăn khiến cho tinh tấn giác chi chưa sanh được sanh khởi, hay tinh tấn giác chi đã sanh được tu tập, được làm cho viên mãn? Có phát cần giới, này các Tỷ-kheo, tinh cần giới, dõng mãnh giới. Ở đây, nếu như lý tác ý được làm cho sung mãn, thời chính cái này là món ăn khiến cho tinh tấn giác chi chưa sanh được sanh khởi, hay tinh tấn giác chi đã sanh được tu tập, được làm cho viên mãn.</p>\n<p><a class='ref vi-n' id='vi-n12' href='#vi-n12'>Vi-n 12</a> Và này các Tỷ-kheo, cái gì là món ăn khiến cho hỷ giác chi chưa sanh được sanh khởi, hay hỷ giác chi đã sanh được tu tập, được làm cho viên mãn? Ở đây, này các Tỷ-kheo, có những pháp trú xứ cho hỷ giác chi. Ở đây, nếu như lý tác ý được làm cho sung mãn, thời chính cái này là món ăn khiến cho hỷ giác chi chưa sanh được sanh khởi, hay hỷ giác chi đã sanh được tu tập, được làm cho viên mãn.</p>\n<p><a class='ref vi-n' id='vi-n13' href='#vi-n13'>Vi-n 13</a> Và này các Tỷ-kheo, cái gì là món ăn khiến cho khinh an giác chi chưa sanh được sanh khởi, hay khinh an giác chi đã sanh được tu tập, được làm cho viên mãn? Này các Tỷ-kheo, có thân khinh an, tâm khinh an. Ở đây, nếu như lý tác ý được làm cho sung mãn, thời chính cái này là món ăn khiến cho khinh an giác chi chưa sanh được sanh khởi, hay khinh an giác chi đã sanh được tu tập, được làm cho viên mãn.</p>\n<p><a class='ref vi-n' id='vi-n14' href='#vi-n14'>Vi-n 14</a> Và này các Tỷ-kheo, cái gì là món ăn khiến cho định giác chi chưa sanh được sanh khởi, hay định giác chi đã sanh được tu tập, được làm cho viên mãn? Này các Tỷ-kheo, có tịnh chỉ tướng, bất loạn tướng. Ở đây, nếu như lý tác ý được làm cho sung mãn, thời chính cái này là món ăn khiến cho định giác chi chưa sanh được sanh khởi, hay định giác chi đã sanh được tu tập, được làm cho viên mãn.</p>\n<p><a class='ref vi-n' id='vi-n15' href='#vi-n15'>Vi-n 15</a> Và này các Tỷ-kheo, cái gì là món ăn khiến cho xả giác chi chưa sanh được sanh khởi, hay xả giác chi đã sanh được tu tập, được làm cho viên mãn? Này các Tỷ-kheo, có các pháp trú xứ cho xả giác chi. Ở đây, nếu như lý tác ý được làm cho sung mãn, thời chính cái này là món ăn khiến cho xả giác chi chưa sanh được sanh khởi, hay xả giác chi đã sanh được tu tập, được làm cho viên mãn.</p>\n<h2>Không Phải Món Ăn Cho Các Triền Cái</h2>\n<p><a class='ref vi-n' id='vi-n16' href='#vi-n16'>Vi-n 16</a> —Và này các Tỷ-kheo, cái gì không phải món ăn khiến cho dục tham chưa sanh được sanh khởi, hay dục tham đã sanh được tăng trưởng, quảng đại? Này các Tỷ-kheo, có bất tịnh tướng. Ở đây, nếu như lý tác ý được làm cho sung mãn, thời chính cái này không phải là món ăn khiến cho dục tham chưa sanh được sanh khởi, hay dục tham đã sanh được tăng trưởng, quảng đại.</p>\n<p><a class='ref vi-n' id='vi-n17' href='#vi-n17'>Vi-n 17</a> Và này các Tỷ-kheo, cái gì không phải món ăn khiến cho sân chưa sanh được sanh khởi, hay sân đã sanh được tăng trưởng, quảng đại? Này các Tỷ-kheo, có từ tâm giải thoát. Ở đây, nếu như lý tác ý được làm cho sung mãn, thời chính cái này không phải là món ăn khiến cho sân chưa sanh được sanh khởi, hay sân đã sanh được tăng trưởng, quảng đại.</p>\n<p><a class='ref vi-n' id='vi-n18' href='#vi-n18'>Vi-n 18</a> Và này các Tỷ-kheo, cái gì không phải món ăn khiến cho hôn trầm thụy miên chưa sanh được sanh khởi, hay hôn trầm thụy miên đã sanh được tăng trưởng, quảng đại? Này các Tỷ-kheo, có phát cần giới, tinh cần giới, dõng mãnh giới. Ở đây, nếu như lý tác ý được làm cho sung mãn, thời chính cái này không phải là món ăn khiến cho hôn trầm thụy miên chưa sanh được sanh khởi, hay hôn trầm thụy miên đã sanh được tăng trưởng, quảng đại.</p>\n<p><a class='ref vi-n' id='vi-n19' href='#vi-n19'>Vi-n 19</a> Và này các Tỷ-kheo, cái gì không phải món ăn khiến cho trạo hối chưa sanh được sanh khởi, hay trạo hối đã sanh được tăng trưởng, quảng đại? Này các Tỷ-kheo, có tâm chỉ tịnh. Ở đây, nếu như lý tác ý được làm cho sung mãn, thời chính cái này không phải là món ăn khiến cho trạo hối chưa sanh được sanh khởi, hay trạo hối đã sanh được tăng trưởng, quảng đại.</p>\n<p><a class='ref vi-n' id='vi-n20' href='#vi-n20'>Vi-n 20</a> Và này các Tỷ-kheo, cái gì không phải món ăn khiến cho nghi hoặc chưa sanh được sanh khởi, hay nghi hoặc đã sanh được tăng trưởng, quảng đại? Này các Tỷ-kheo, có pháp thiện và bất thiện, có pháp có tội và không có tội, có pháp liệt và thắng, có pháp dự phần vào đen và trắng. Ở đây, nếu như lý tác ý được làm cho sung mãn, thời chính cái này không phải là món ăn khiến cho nghi hoặc chưa sanh được sanh khởi, hay nghi hoặc đã sanh được tăng trưởng, quảng đại.</p>\n<h2>Không Phải Là Món Ăn Cho Các Giác Chi</h2>\n<p><a class='ref vi-n' id='vi-n21' href='#vi-n21'>Vi-n 21</a> —Và này các Tỷ-kheo, cái gì không phải là món ăn khiến cho niệm giác chi chưa sanh được sanh khởi, hay niệm giác chi đã sanh được tu tập, được làm cho viên mãn? Này các Tỷ-kheo, có các pháp trú xứ cho niệm giác chi. Ở đây, nếu phi như lý tác ý được làm cho sung mãn, thời chính cái này không phải món ăn khiến niệm giác chi chưa sanh được sanh khởi, hay niệm giác chi đã sanh được tu tập, được làm cho viên mãn.</p>\n<p><a class='ref vi-n' id='vi-n22' href='#vi-n22'>Vi-n 22</a> Và này các Tỷ-kheo, cái gì không phải là món ăn khiến cho trạch pháp giác chi chưa sanh được sanh khởi, hay trạch pháp giác chi đã sanh được tu tập, được làm cho viên mãn? Này các Tỷ-kheo, có các pháp thiện và bất thiện, có tội và không có tội, liệt và thắng, dự phần vào đen và trắng. Ở đây, nếu phi như lý tác ý được làm cho sung mãn, thời chính cái này không phải là món ăn khiến cho trạch pháp giác chi chưa sanh được sanh khởi, hay trạch pháp giác chi đã sanh được tu tập, được làm cho viên mãn.</p>\n<p><a class='ref vi-n' id='vi-n23' href='#vi-n23'>Vi-n 23</a> Và này các Tỷ-kheo, cái gì không phải là món ăn khiến cho tinh tấn giác chi chưa sanh được sanh khởi, hay tinh tấn giác chi đã sanh được tu tập, được làm cho viên mãn? Này các Tỷ-kheo, có phát cần giới, tinh cần giới, dõng mãnh giới. Ở đây, nếu phi như lý tác ý được làm cho sung mãn, thời chính cái này không phải là món ăn khiến cho tinh tấn giác chi chưa sanh được sanh khởi, hay tinh tấn giác chi đã sanh được tu tập, được làm cho viên mãn.</p>\n<p><a class='ref vi-n' id='vi-n24' href='#vi-n24'>Vi-n 24</a> Và này các Tỷ-kheo, cái gì không phải món ăn khiến cho hỷ giác chi chưa sanh được sanh khởi, hay hỷ giác chi đã sanh được tu tập, được làm cho viên mãn? Này các Tỷ-kheo, có những pháp trú xứ cho hỷ giác chi. Ở đây, nếu phi như lý tác ý được làm cho sung mãn, thời chính cái này không phải món ăn khiến cho hỷ giác chi chưa sanh được sanh khởi, hay hỷ giác chi đã sanh được tu tập, được làm cho viên mãn.</p>\n<p><a class='ref vi-n' id='vi-n25' href='#vi-n25'>Vi-n 25</a> Và này các Tỷ-kheo, cái gì không phải món ăn khiến cho khinh an giác chi chưa sanh được sanh khởi, hay khinh an giác chi đã sanh được tu tập, được làm cho viên mãn? Này các Tỷ-kheo, có thân khinh an, tâm khinh an. Ở đây, nếu phi như lý tác ý, làm cho sung mãn, thời chính cái này không phải món ăn khiến cho khinh an giác chi chưa sanh được sanh khởi, hay khinh an giác chi đã sanh được tu tập, được làm cho viên mãn.</p>\n<p><a class='ref vi-n' id='vi-n26' href='#vi-n26'>Vi-n 26</a> Và này các Tỷ-kheo, cái gì không phải món ăn khiến cho định giác chi chưa sanh được sanh khởi, hay định giác chi đã sanh được tu tập, được làm cho viên mãn? Này các Tỷ-kheo, có tịnh chỉ tướng, bất loạn tướng. Ở đây, nếu phi như lý tác ý được làm cho sung mãn, thời chính cái này không phải món ăn khiến cho định giác chi chưa sanh được sanh khởi, hay định giác chi đã sanh được tu tập, được làm cho viên mãn.</p>\n<p><a class='ref vi-n' id='vi-n27' href='#vi-n27'>Vi-n 27</a> Và này các Tỷ-kheo, cái gì không phải món ăn khiến cho xả giác chi chưa sanh được sanh khởi, hay xả giác chi đã sanh được tu tập, được làm cho viên mãn? Này các Tỷ-kheo, có các pháp trú xứ cho xả giác chi. Ở đây, nếu phi như lý tác ý được làm cho sung mãn, thời chính cái này không phải món ăn khiến cho xả giác chi chưa sanh được sanh khởi, hay xả giác chi đã sanh được tu tập, được làm cho viên mãn.</p>\n<footer>\n<p>Bộ kinh đã được <span class='author'>Hòa thượng Thích Minh Châu</span> dịch sang Việt ngữ và Thiền viện Vạn Hạnh phát hành trong đầu thập niên <span class='publication-date'>1980</span>. Sau đó, trong chương trình phiên dịch và ấn hành Ðại tạng kinh Việt Nam, bộ kinh được tái bản năm 1993 và có số thứ tự từ 12 đến 16.</p>\n<p>Prepared for SuttaCentral by <span class='editor'>Blake Walsh</span>.</p>\n</footer>\n</article>\n</body>\n</html>\n"
  },
  "translation": {
    "uid": "sn46.51",
    "lang": "vi",
    "is_root": false,
    "title": "Ðồ Ăn",
    "author": "Thích Minh Châu",
    "author_short": "Minh Châu",
    "author_uid": "minh_chau",
    "next": {
      "author_uid": "minh_chau",
      "lang": "vi",
      "name": "Is There a Way? ",
      "uid": "sn46.52"
    },
    "previous": {
      "author_uid": "minh_chau",
      "lang": "vi",
      "name": "Exterior ",
      "uid": "sn46.50"
    },
    "text": "<!DOCTYPE html>\n<html>\n<head>\n<meta charset='UTF-8'>\n<meta name='author' content='Thích Minh Châu'>\n<title></title>\n</head>\n<body>\n<article id='sn46.51' lang='vi'>\n<header>\n<ul>\n<li class='division'>Chương 46: Tương Ưng Giác Chi</li>\n<li>VI: Phẩm Tổng Nhiếp Giác Chi</li>\n</ul>\n<h1>46.51. Ðồ Ăn</h1>\n</header>\n<p><a class='ref vi-n' id='vi-n1' href='#vi-n1'>Vi-n 1</a> Tất cả nhân duyên ở <i lang='pli' translate='no'>Sāvatthi</i> …</p>\n<p><a class='pts' id='S.v,102' href='#S.v,102'></a><a class='vnO' id='Tạp.27,.4,.Ðại.2,192a'></a><a class='ref vi-n' id='vi-n2' href='#vi-n2'>Vi-n 2</a> …</p>\n<p><a class='ref vi-n' id='vi-n3' href='#vi-n3'>Vi-n 3</a> —Ta sẽ giảng cho các Ông, này các Tỷ-kheo, các món ăn và không phải món ăn của năm triền cái và bảy giác chi. Hãy lắng nghe.</p>\n<h2>Món Ăn Của Các Triền Cái</h2>\n<p><a class='ref vi-n' id='vi-n4' href='#vi-n4'>Vi-n 4</a> —Cái gì là món ăn, này các Tỷ-kheo, khiến cho dục tham (kàmacchanda) chưa sanh được sanh khởi; hay dục tham đã sanh được tăng trưởng, quảng đại? Có tịnh tướng, này các Tỷ-kheo. Ở đây, nếu phi như lý tác ý được làm cho sung mãn, thời chính cái này là món ăn khiến cho dục tham chưa sanh được sanh khởi, hay dục tham đã sanh được tăng trưởng, quảng đại.</p>\n<p><a class='ref vi-n' id='vi-n5' href='#vi-n5'>Vi-n 5</a> Cái gì là món ăn, này các Tỷ-kheo, khiến cho sân chưa sanh được sanh khởi; hay sân đã sanh được tăng trưởng, quảng đại? Có chướng ngại tướng (patighanimittam), này các Tỷ-kheo. Ở đây, nếu phi như lý tác ý được làm cho sung mãn, thời chính cái này là món ăn khiến cho sân chưa sanh được sanh khởi, hay sân đã sanh được tăng trưởng, quảng đại.</p>\n<p><a class='ref vi-n' id='vi-n6' href='#vi-n6'>Vi-n 6</a> Cái gì là món ăn, này các Tỷ-kheo, khiến cho hôn trầm thụy miên chưa sanh được sanh khởi; hay hôn trầm thụy miên đã sanh được tăng trưởng, quảng đại? Không hân hoan, biếng nhác, chán nản, ăn quá no, tâm uể oải. Ở đây, nếu phi như lý tác ý được làm cho sung mãn, thời chính cái này là món ăn khiến cho hôn trầm thụy miên chưa sanh được sanh khởi, hay hôn trầm thụy miên đã sanh được tăng trưởng, quảng đại.</p>\n<p><a class='ref vi-n' id='vi-n7' href='#vi-n7'>Vi-n 7</a> Cái gì là món ăn, này các Tỷ-kheo, khiến cho trạo hối chưa sanh được sanh khởi, hay trạo hối đã sanh được tăng trưởng, quảng đại? Có tâm chưa được chỉ tịnh, này các Tỷ-kheo. Ở đây, nếu phi như lý tác ý được làm cho sung mãn, thời chính cái này là món ăn khiến cho trạo hối chưa sanh được sanh khởi, hay trạo hối đã sanh được tăng trưởng, quảng đại.</p>\n<p><a class='ref vi-n' id='vi-n8' href='#vi-n8'>Vi-n 8</a> Cái gì là món ăn, này các Tỷ-kheo, khiến cho nghi hoặc chưa sanh được sanh khởi, hay nghi hoặc đã sanh được tăng trưởng, quảng đại? Có các pháp trú xứ của nghi hoặc. Ở đây, nếu phi như lý tác ý được làm cho sung mãn, thời chính cái này là món ăn khiến cho nghi hoặc chưa sanh được sanh khởi, hay nghi hoặc đã sanh được tăng trưởng, quảng đại.</p>\n<h2>Món Ăn Cho Các Giác Chi</h2>\n<p><a class='ref vi-n' id='vi-n9' href='#vi-n9'>Vi-n 9</a> —Cái gì là món ăn, này các Tỷ-kheo, khiến cho niệm giác chi chưa sanh được sanh khởi, hay niệm giác chi đã sanh được tu tập, được làm cho viên mãn? Này các Tỷ-kheo, có các pháp trú xứ cho niệm giác chi. Ở đây, nếu như lý tác ý được làm cho sung mãn, thời chính cái này là món ăn khiến cho niệm giác chi chưa sanh được sanh khởi, hay niệm giác chi đã sanh được tu tập, làm cho viên mãn.</p>\n<p><a class='ref vi-n' id='vi-n10' href='#vi-n10'>Vi-n 10</a> Và này các Tỷ-kheo, cái gì là món ăn khiến cho trạch pháp giác chi chưa sanh được sanh khởi, hay trạch pháp giác chi đã sanh được tu tập, được làm cho viên mãn? Có những pháp thiện và bất thiện, này các Tỷ-kheo, có những pháp có tội và không có tội, có những pháp liệt và thắng, có những pháp dự phần đen và trắng. Ở đây, nếu như lý tác ý được làm cho sung mãn, thời chính cái này là món ăn khiến cho trạch pháp giác chi chưa sanh được sanh khởi, hay trạch pháp giác chi đã sanh được tu tập, được làm cho viên mãn.</p>\n<p><a class='ref vi-n' id='vi-n11' href='#vi-n11'>Vi-n 11</a> Và này các Tỷ-kheo, cái gì là món ăn khiến cho tinh tấn giác chi chưa sanh được sanh khởi, hay tinh tấn giác chi đã sanh được tu tập, được làm cho viên mãn? Có phát cần giới, này các Tỷ-kheo, tinh cần giới, dõng mãnh giới. Ở đây, nếu như lý tác ý được làm cho sung mãn, thời chính cái này là món ăn khiến cho tinh tấn giác chi chưa sanh được sanh khởi, hay tinh tấn giác chi đã sanh được tu tập, được làm cho viên mãn.</p>\n<p><a class='ref vi-n' id='vi-n12' href='#vi-n12'>Vi-n 12</a> Và này các Tỷ-kheo, cái gì là món ăn khiến cho hỷ giác chi chưa sanh được sanh khởi, hay hỷ giác chi đã sanh được tu tập, được làm cho viên mãn? Ở đây, này các Tỷ-kheo, có những pháp trú xứ cho hỷ giác chi. Ở đây, nếu như lý tác ý được làm cho sung mãn, thời chính cái này là món ăn khiến cho hỷ giác chi chưa sanh được sanh khởi, hay hỷ giác chi đã sanh được tu tập, được làm cho viên mãn.</p>\n<p><a class='ref vi-n' id='vi-n13' href='#vi-n13'>Vi-n 13</a> Và này các Tỷ-kheo, cái gì là món ăn khiến cho khinh an giác chi chưa sanh được sanh khởi, hay khinh an giác chi đã sanh được tu tập, được làm cho viên mãn? Này các Tỷ-kheo, có thân khinh an, tâm khinh an. Ở đây, nếu như lý tác ý được làm cho sung mãn, thời chính cái này là món ăn khiến cho khinh an giác chi chưa sanh được sanh khởi, hay khinh an giác chi đã sanh được tu tập, được làm cho viên mãn.</p>\n<p><a class='ref vi-n' id='vi-n14' href='#vi-n14'>Vi-n 14</a> Và này các Tỷ-kheo, cái gì là món ăn khiến cho định giác chi chưa sanh được sanh khởi, hay định giác chi đã sanh được tu tập, được làm cho viên mãn? Này các Tỷ-kheo, có tịnh chỉ tướng, bất loạn tướng. Ở đây, nếu như lý tác ý được làm cho sung mãn, thời chính cái này là món ăn khiến cho định giác chi chưa sanh được sanh khởi, hay định giác chi đã sanh được tu tập, được làm cho viên mãn.</p>\n<p><a class='ref vi-n' id='vi-n15' href='#vi-n15'>Vi-n 15</a> Và này các Tỷ-kheo, cái gì là món ăn khiến cho xả giác chi chưa sanh được sanh khởi, hay xả giác chi đã sanh được tu tập, được làm cho viên mãn? Này các Tỷ-kheo, có các pháp trú xứ cho xả giác chi. Ở đây, nếu như lý tác ý được làm cho sung mãn, thời chính cái này là món ăn khiến cho xả giác chi chưa sanh được sanh khởi, hay xả giác chi đã sanh được tu tập, được làm cho viên mãn.</p>\n<h2>Không Phải Món Ăn Cho Các Triền Cái</h2>\n<p><a class='ref vi-n' id='vi-n16' href='#vi-n16'>Vi-n 16</a> —Và này các Tỷ-kheo, cái gì không phải món ăn khiến cho dục tham chưa sanh được sanh khởi, hay dục tham đã sanh được tăng trưởng, quảng đại? Này các Tỷ-kheo, có bất tịnh tướng. Ở đây, nếu như lý tác ý được làm cho sung mãn, thời chính cái này không phải là món ăn khiến cho dục tham chưa sanh được sanh khởi, hay dục tham đã sanh được tăng trưởng, quảng đại.</p>\n<p><a class='ref vi-n' id='vi-n17' href='#vi-n17'>Vi-n 17</a> Và này các Tỷ-kheo, cái gì không phải món ăn khiến cho sân chưa sanh được sanh khởi, hay sân đã sanh được tăng trưởng, quảng đại? Này các Tỷ-kheo, có từ tâm giải thoát. Ở đây, nếu như lý tác ý được làm cho sung mãn, thời chính cái này không phải là món ăn khiến cho sân chưa sanh được sanh khởi, hay sân đã sanh được tăng trưởng, quảng đại.</p>\n<p><a class='ref vi-n' id='vi-n18' href='#vi-n18'>Vi-n 18</a> Và này các Tỷ-kheo, cái gì không phải món ăn khiến cho hôn trầm thụy miên chưa sanh được sanh khởi, hay hôn trầm thụy miên đã sanh được tăng trưởng, quảng đại? Này các Tỷ-kheo, có phát cần giới, tinh cần giới, dõng mãnh giới. Ở đây, nếu như lý tác ý được làm cho sung mãn, thời chính cái này không phải là món ăn khiến cho hôn trầm thụy miên chưa sanh được sanh khởi, hay hôn trầm thụy miên đã sanh được tăng trưởng, quảng đại.</p>\n<p><a class='ref vi-n' id='vi-n19' href='#vi-n19'>Vi-n 19</a> Và này các Tỷ-kheo, cái gì không phải món ăn khiến cho trạo hối chưa sanh được sanh khởi, hay trạo hối đã sanh được tăng trưởng, quảng đại? Này các Tỷ-kheo, có tâm chỉ tịnh. Ở đây, nếu như lý tác ý được làm cho sung mãn, thời chính cái này không phải là món ăn khiến cho trạo hối chưa sanh được sanh khởi, hay trạo hối đã sanh được tăng trưởng, quảng đại.</p>\n<p><a class='ref vi-n' id='vi-n20' href='#vi-n20'>Vi-n 20</a> Và này các Tỷ-kheo, cái gì không phải món ăn khiến cho nghi hoặc chưa sanh được sanh khởi, hay nghi hoặc đã sanh được tăng trưởng, quảng đại? Này các Tỷ-kheo, có pháp thiện và bất thiện, có pháp có tội và không có tội, có pháp liệt và thắng, có pháp dự phần vào đen và trắng. Ở đây, nếu như lý tác ý được làm cho sung mãn, thời chính cái này không phải là món ăn khiến cho nghi hoặc chưa sanh được sanh khởi, hay nghi hoặc đã sanh được tăng trưởng, quảng đại.</p>\n<h2>Không Phải Là Món Ăn Cho Các Giác Chi</h2>\n<p><a class='ref vi-n' id='vi-n21' href='#vi-n21'>Vi-n 21</a> —Và này các Tỷ-kheo, cái gì không phải là món ăn khiến cho niệm giác chi chưa sanh được sanh khởi, hay niệm giác chi đã sanh được tu tập, được làm cho viên mãn? Này các Tỷ-kheo, có các pháp trú xứ cho niệm giác chi. Ở đây, nếu phi như lý tác ý được làm cho sung mãn, thời chính cái này không phải món ăn khiến niệm giác chi chưa sanh được sanh khởi, hay niệm giác chi đã sanh được tu tập, được làm cho viên mãn.</p>\n<p><a class='ref vi-n' id='vi-n22' href='#vi-n22'>Vi-n 22</a> Và này các Tỷ-kheo, cái gì không phải là món ăn khiến cho trạch pháp giác chi chưa sanh được sanh khởi, hay trạch pháp giác chi đã sanh được tu tập, được làm cho viên mãn? Này các Tỷ-kheo, có các pháp thiện và bất thiện, có tội và không có tội, liệt và thắng, dự phần vào đen và trắng. Ở đây, nếu phi như lý tác ý được làm cho sung mãn, thời chính cái này không phải là món ăn khiến cho trạch pháp giác chi chưa sanh được sanh khởi, hay trạch pháp giác chi đã sanh được tu tập, được làm cho viên mãn.</p>\n<p><a class='ref vi-n' id='vi-n23' href='#vi-n23'>Vi-n 23</a> Và này các Tỷ-kheo, cái gì không phải là món ăn khiến cho tinh tấn giác chi chưa sanh được sanh khởi, hay tinh tấn giác chi đã sanh được tu tập, được làm cho viên mãn? Này các Tỷ-kheo, có phát cần giới, tinh cần giới, dõng mãnh giới. Ở đây, nếu phi như lý tác ý được làm cho sung mãn, thời chính cái này không phải là món ăn khiến cho tinh tấn giác chi chưa sanh được sanh khởi, hay tinh tấn giác chi đã sanh được tu tập, được làm cho viên mãn.</p>\n<p><a class='ref vi-n' id='vi-n24' href='#vi-n24'>Vi-n 24</a> Và này các Tỷ-kheo, cái gì không phải món ăn khiến cho hỷ giác chi chưa sanh được sanh khởi, hay hỷ giác chi đã sanh được tu tập, được làm cho viên mãn? Này các Tỷ-kheo, có những pháp trú xứ cho hỷ giác chi. Ở đây, nếu phi như lý tác ý được làm cho sung mãn, thời chính cái này không phải món ăn khiến cho hỷ giác chi chưa sanh được sanh khởi, hay hỷ giác chi đã sanh được tu tập, được làm cho viên mãn.</p>\n<p><a class='ref vi-n' id='vi-n25' href='#vi-n25'>Vi-n 25</a> Và này các Tỷ-kheo, cái gì không phải món ăn khiến cho khinh an giác chi chưa sanh được sanh khởi, hay khinh an giác chi đã sanh được tu tập, được làm cho viên mãn? Này các Tỷ-kheo, có thân khinh an, tâm khinh an. Ở đây, nếu phi như lý tác ý, làm cho sung mãn, thời chính cái này không phải món ăn khiến cho khinh an giác chi chưa sanh được sanh khởi, hay khinh an giác chi đã sanh được tu tập, được làm cho viên mãn.</p>\n<p><a class='ref vi-n' id='vi-n26' href='#vi-n26'>Vi-n 26</a> Và này các Tỷ-kheo, cái gì không phải món ăn khiến cho định giác chi chưa sanh được sanh khởi, hay định giác chi đã sanh được tu tập, được làm cho viên mãn? Này các Tỷ-kheo, có tịnh chỉ tướng, bất loạn tướng. Ở đây, nếu phi như lý tác ý được làm cho sung mãn, thời chính cái này không phải món ăn khiến cho định giác chi chưa sanh được sanh khởi, hay định giác chi đã sanh được tu tập, được làm cho viên mãn.</p>\n<p><a class='ref vi-n' id='vi-n27' href='#vi-n27'>Vi-n 27</a> Và này các Tỷ-kheo, cái gì không phải món ăn khiến cho xả giác chi chưa sanh được sanh khởi, hay xả giác chi đã sanh được tu tập, được làm cho viên mãn? Này các Tỷ-kheo, có các pháp trú xứ cho xả giác chi. Ở đây, nếu phi như lý tác ý được làm cho sung mãn, thời chính cái này không phải món ăn khiến cho xả giác chi chưa sanh được sanh khởi, hay xả giác chi đã sanh được tu tập, được làm cho viên mãn.</p>\n<footer>\n<p>Bộ kinh đã được <span class='author'>Hòa thượng Thích Minh Châu</span> dịch sang Việt ngữ và Thiền viện Vạn Hạnh phát hành trong đầu thập niên <span class='publication-date'>1980</span>. Sau đó, trong chương trình phiên dịch và ấn hành Ðại tạng kinh Việt Nam, bộ kinh được tái bản năm 1993 và có số thứ tự từ 12 đến 16.</p>\n<p>Prepared for SuttaCentral by <span class='editor'>Blake Walsh</span>.</p>\n</footer>\n</article>\n</body>\n</html>\n"
  },
  "segmented": false,
  "suttaplex": {
    "acronym": "SN 46.51",
    "volpages": " PTS 5.103, PTS 5.104, PTS 5.105, PTS 5.106, PTS 5.107",
    "alt_volpages": null,
    "uid": "sn46.51",
    "blurb": "The Buddha spells out in detail the factors that nourish the hindrances, and those that nourish the awakening factors.",
    "difficulty": null,
    "original_title": "Āhārasutta",
    "root_lang": "pli",
    "root_lang_name": "Pāli",
    "type": "leaf",
    "from": null,
    "translated_title": "Ðồ Ăn",
    "translations": [
      {
        "lang": "de",
        "lang_name": "Deutsch",
        "is_root": false,
        "author": "Sabbamitta",
        "author_short": "sabbamitta",
        "author_uid": "sabbamitta",
        "publication_date": "2019",
        "id": "sn46.51_translation-de-sabbamitta",
        "segmented": true,
        "title": "Nahrung ",
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "en",
        "lang_name": "English",
        "is_root": false,
        "author": "Bhikkhu Sujato",
        "author_short": "sujato",
        "author_uid": "sujato",
        "publication_date": "2018",
        "id": "sn46.51_translation-en-sujato",
        "segmented": true,
        "title": "Nourishing ",
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "pli",
        "lang_name": "Pāli",
        "is_root": true,
        "author": "Mahāsaṅgīti Tipiṭaka Buddhavasse 2500",
        "author_short": "ms",
        "author_uid": "ms",
        "publication_date": null,
        "id": "sn46.51_root-pli-ms",
        "segmented": true,
        "title": null,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "bn",
        "lang_name": "বাংলা",
        "is_root": false,
        "author": "বঙ্গীস ভিক্ষু, অজিত ভিক্ষু, প্রজ্ঞাদর্শী ভিক্ষু",
        "author_short": "বঙ্গীস …",
        "author_uid": "bangish-ajit-pragyadarshi",
        "publication_date": "2018",
        "id": "bn_sn46.51_bangish-ajit-pragyadarshi",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "de",
        "lang_name": "Deutsch",
        "is_root": false,
        "author": "Dr. Hellmuth Hecker",
        "author_short": "Hecker",
        "author_uid": "hecker",
        "publication_date": "1993",
        "id": "de_sn46.51_hecker",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "en",
        "lang_name": "English",
        "is_root": false,
        "author": "Bhikkhu Bodhi",
        "author_short": "Bodhi",
        "author_uid": "bodhi",
        "publication_date": "2000",
        "id": "en_sn46.51_bodhi",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "fr",
        "lang_name": "Français",
        "is_root": false,
        "author": "Claude Le Ninan, Chandhana Le Ninan",
        "author_short": "leninan",
        "author_uid": "leninan",
        "publication_date": "2023",
        "id": "fr_sn46.51_leninan",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "id",
        "lang_name": "Bahasa Indonesia",
        "is_root": false,
        "author": "Indra Anggara",
        "author_short": "Anggara",
        "author_uid": "anggara",
        "publication_date": null,
        "id": "id_sn46.51_anggara",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "it",
        "lang_name": "Italiano",
        "is_root": false,
        "author": "Enzo Alfano",
        "author_short": "Alfano",
        "author_uid": "alfano",
        "publication_date": null,
        "id": "it_sn46.51_alfano",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "jpn",
        "lang_name": "日本語",
        "is_root": false,
        "author": "関西パーリ語実習会",
        "author_short": "関西パーリ語実習会",
        "author_uid": "kansai",
        "publication_date": "2023",
        "id": "jpn_sn46.51_kansai",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "my",
        "lang_name": "မြန်မာဘာသာ",
        "is_root": false,
        "author": "Pitaka Myanmar Translation",
        "author_short": "PMT",
        "author_uid": "pmt",
        "publication_date": null,
        "id": "my_sn46.51_pmt",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "no",
        "lang_name": "Norsk",
        "is_root": false,
        "author": "Kåre A. Lie",
        "author_short": "Lie",
        "author_uid": "lie",
        "publication_date": "2018",
        "id": "no_sn46.51_lie",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "pt",
        "lang_name": "Português",
        "is_root": false,
        "author": "Michael Beisert",
        "author_short": "Beisert",
        "author_uid": "beisert",
        "publication_date": "2014",
        "id": "pt_sn46.51_beisert",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "ru",
        "lang_name": "Русский",
        "is_root": false,
        "author": "SV",
        "author_short": "SV",
        "author_uid": "sv",
        "publication_date": "2012",
        "id": "ru_sn46.51_sv",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "si",
        "lang_name": "සිංහල",
        "is_root": false,
        "author": "A.P. de Zoysa",
        "author_short": "Zoysa",
        "author_uid": "zoysa",
        "publication_date": null,
        "id": "si_sn46.51_zoysa",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "sv",
        "lang_name": "Svenska",
        "is_root": false,
        "author": "Kerstin Jönhagen",
        "author_short": "Jönhagen",
        "author_uid": "jonhagen",
        "publication_date": null,
        "id": "sv_sn46.51_jonhagen",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "th",
        "lang_name": "ไทย",
        "is_root": false,
        "author": "Siam Rath",
        "author_short": "Siam Rath",
        "author_uid": "siam_rath",
        "publication_date": null,
        "id": "th_sn46.51_siam_rath",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "author": "Thích Minh Châu",
        "author_short": "Minh Châu",
        "author_uid": "minh_chau",
        "has_comment": false,
        "id": "vi_sn46.51_minh_chau",
        "is_root": false,
        "lang": "vi",
        "lang_name": "Tiếng Việt",
        "publication_date": "1980",
        "segmented": false,
        "volpage": null,
        "title": "Ðồ Ăn"
      },
      {
        "lang": "zh",
        "lang_name": "汉语",
        "is_root": false,
        "author": "莊春江",
        "author_short": "莊春江",
        "author_uid": "zhuang",
        "publication_date": null,
        "id": "zh_sn46.51_zhuang",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      }
    ],
    "parallel_count": 2,
    "biblio": null,
    "priority_author_uid": null,
    "verseNo": "bj17.1.202, dr19.137, ms14S5_555, msdiv232, pts-vp-pli5.103, sya19.143, vri27.124,csp1ed14.91, csp2ed14.91, ms14S5_556,ms14S5_557, sya19.144,cck19.122, dr19.138, ms14S5_558, ndp15.94,ms14S5_559,ms14S5_560, pts-vp-pli5.104,bj17.1.204, ms14S5_561, sya19.145, vri27.125,csp1ed14.92, csp2ed14.92, dr19.139, ms14S5_562,cck19.123, ms14S5_563, ndp15.95,ms14S5_564, sya19.146,ms14S5_565, pts-vp-pli5.105,dr19.140, ms14S5_566, vri27.126,bj17.1.206, csp1ed14.93, csp2ed14.93, ms14S5_567,cck19.124, ms14S5_568, sya19.147,ms14S5_569, ndp15.96, pts-vp-pli5.106,dr19.141, ms14S5_570,ms14S5_571, sya19.148, vri27.127,ms14S5_572,bj17.1.208, cck19.125, csp1ed14.94, csp2ed14.94, ms14S5_573,dr19.142, ms14S5_574, pts-vp-pli5.107, sya19.149,ms14S5_575, ndp15.97,ms14S5_576,cck19.126, ms14S5_577, vri27.128,csp1ed14.95, csp2ed14.95, dr19.143, ms14S5_578, sya19.150",
    "previous": {
      "name": null,
      "uid": null
    },
    "next": {
      "name": null,
      "uid": null
    }
  },
  "bilara_root_text": {
    "uid": "sn46.51",
    "author": "Mahāsaṅgīti Tipiṭaka Buddhavasse 2500",
    "author_short": "ms",
    "author_uid": "ms",
    "lang": "pli",
    "title": "Āhārasutta",
    "previous": {
      "author_uid": "ms",
      "lang": "pli",
      "name": null,
      "uid": null
    },
    "next": {
      "author_uid": "ms",
      "lang": "pli",
      "name": null,
      "uid": null
    }
  },
  "bilara_translated_text": null,
  "candidate_authors": [
    "sujato",
    "bodhi"
  ]
}