{
  "root_text": {
    "uid": "an7.55",
    "lang": "vi",
    "is_root": false,
    "title": "Sanh Thú Của Loài Người",
    "author": "Thích Minh Châu",
    "author_short": "Minh Châu",
    "author_uid": "minh_chau",
    "next": {
      "author_uid": "minh_chau",
      "lang": "vi",
      "name": "Tissa the Divinity ",
      "uid": "an7.56"
    },
    "previous": {
      "author_uid": "minh_chau",
      "lang": "vi",
      "name": "The Undeclared Points ",
      "uid": "an7.54"
    },
    "text": "<!DOCTYPE html>\n<html>\n<head>\n<meta charset='UTF-8'>\n<meta name='author' content='Thích Minh Châu'>\n<title></title>\n</head>\n<body>\n<article id='an7.55' lang='vi'>\n<header>\n<ul>\n<li class='division' lang='pli' translate='no'>Aṅguttara Nikāya</li>\n<li><span class='roman-numerals'>VI</span>. Phẩm Không Tuyên Bố</li>\n</ul>\n<h1>7.55. Sanh Thú Của Loài Người</h1>\n</header>\n<p><a class='ref ttc' id='ttc1' href='#ttc1'>TTC 1</a>—Này các Tỷ-kheo, Ta sẽ giảng về bảy sanh thú của loài Người, và không chấp thủ Niết-bàn. Hãy lắng nghe và suy nghiệm kỹ, Ta sẽ nói:</p>\n<p>—Thưa vâng, bạch Thế Tôn.</p>\n<p>Các Tỷ-kheo ấy vâng đáp Thế Tôn. Thế Tôn nói như sau:</p>\n<p>—Này các Tỷ-kheo. Thế nào là bảy sanh thú của loài Người?</p>\n<p><a class='ref ttc' id='ttc2' href='#ttc2'>TTC 2</a>Ở đây, này các Tỷ-kheo, Tỷ-kheo trong khi thực hành như vậy suy nghĩ như sau: “Nếu cái này không có, cái này có thể không phải của ta. Nếu cái này sẽ không có, cái này sẽ không phải của ta. Cái gì có, cái gì được thành, ta đều từ bỏ”. Vị ấy có được xả. Vị ấy không tham đắm sanh hữu, không tham đắm tích tụ của hữu; với chánh trí tuệ, vị ấy thấy có con đường vô thượng tịch tịnh. Vị ấy chưa chứng ngộ trọn vẹn hoàn toàn con đường ấy. Vị ấy chưa đoạn tận trọn vẹn hoàn toàn mạn tùy miên. Vị ấy chưa đoạn tận trọn vẹn hoàn toàn hữu tham tùy miên. Vị ấy chưa đoạn tận trọn vẹn hoàn toàn vô minh tùy miên. Do diệt tận năm hạ phần kiết sử, vị ấy chứng được Trung gian Niết-bàn. Ví như, này các Tỷ-kheo, một cái bát bằng sắt được đốt cháy cả ngày và được đập đánh, một miếng vụn có thể văng ra và trở thành nguội lạnh. Cũng vậy, này các Tỷ-kheo, Tỷ-kheo trong khi thực hành, suy nghĩ như sau: “Nếu cái này không có, cái này có thể không phải của ta. Nếu cái này sẽ không có, cái này sẽ không phải của ta. Cái gì có, cái gì được thành, ta đều từ bỏ”. Vị ấy có được xả, vị ấy không tham đắm hữu, không tham đắm hậu hữu; với chánh trí tuệ, vị ấy thấy có con đường vô thượng tịch tịnh. Và vị ấy chưa chứng ngộ trọn vẹn hoàn toàn con đường ấy. Vị ấy chưa đoạn tận trọn vẹn hoàn toàn mạn tùy miên. Vị ấy chưa đoạn tận trọn vẹn hoàn toàn hữu tham tùy miên. Vị ấy chưa đoạn tận trọn vẹn hoàn toàn vô minh tùy miên. Do diệt tận năm hạ phần kiết sử, vị ấy chứng được Trung gian Niết-bàn.</p>\n<p><a class='ref ttc' id='ttc3' href='#ttc3'>TTC 3</a>Ở đây, này các Tỷ-kheo, Tỷ-kheo trong thực hành suy nghĩ như sau: “Nếu cái này không có, cái này có thể không phải của ta. Nếu cái này sẽ không có, cái này sẽ không phải của ta. Cái gì có, cái gì được thành, ta đều từ bỏ”. Vị ấy có được xả, vị ấy không tham đắm sanh hữu, không tham đắm tích tụ của hữu; với chánh trí tuệ, vị ấy thấy có con đường vô thượng tịch tịnh và vị ấy chưa chứng ngộ trọn vẹn hoàn toàn con đường ấy. Vị ấy chưa đoạn tận trọn vẹn hoàn toàn mạn tùy miên. Vị ấy chưa đoạn tận trọn vẹn hoàn toàn hữu tham tùy miên. Vị ấy chưa đoạn tận trọn vẹn hoàn toàn vô minh tùy miên. Do diệt tận năm hạ phần kiết sử, vị ấy chứng được Trung gian Niết-bàn. Ví như, này các Tỷ-kheo, một cái bát bằng sắt được đốt cháy cả ngày và được đập đánh, một miếng vụn có thể văng ra, có thể bay lên và trở thành nguội lạnh. Cũng vậy, này các Tỷ-kheo, Tỷ-kheo trong khi thực hành, suy nghĩ như sau: “Nếu cái này không có, cái này có thể không phải của ta. Nếu cái này sẽ không có, cái này sẽ không phải của ta…”. Vị ấy đoạn diệt tận năm hạ phần kiết sử, vị ấy chứng được Trung gian Niết-bàn.</p>\n<p><a class='ref ttc' id='ttc4' href='#ttc4'>TTC 4</a>Nhưng ở đây, này các Tỷ-kheo, Tỷ-kheo trong khi thực hành suy nghĩ như sau: “Nếu cái này không có, cái này có thể không phải của ta. Nếu cái này sẽ không có, cái này sẽ không phải của ta…”. Vị ấy đoạn diệt tận năm hạ phần kiết sử, vị ấy chứng được Trung gian Niết-bàn. Ví như, này các Tỷ-kheo, một cái bát bằng sắt được đốt cháy cả ngày và được đập đánh, một miếng vụn có thể văng ra, có thể bay lên, sau khi chưa chạm vào đất, có thể trở thành nguội lạnh. Cũng vậy, này các Tỷ-kheo, Tỷ-kheo trong khi thực hành, suy nghĩ như sau: “Nếu cái này không có, cái này có thể không phải của ta. Nếu cái này sẽ không có, cái này sẽ không phải của ta…”. Vị ấy, sau khi diệt tận năm hạ phần kiết sử, vị ấy chứng được Trung gian Niết-bàn.</p>\n<p><a class='ref ttc' id='ttc5' href='#ttc5'>TTC 5</a>Nhưng ở đây, này các Tỷ-kheo, Tỷ-kheo trong khi thực hành, suy nghĩ như sau: “Nếu cái này không có, cái này có thể không phải của ta. Nếu cái này sẽ không có, cái này sẽ không phải của ta…”. Vị ấy, do diệt tận năm hạ phần kiết sử, chứng được Tổn hại Bát-niết-bàn. Ví như, này các Tỷ-kheo, một cái bát bằng sắt được đốt cháy cả ngày và được đập đánh, một miếng vụn có thể văng ra , có thể bay lên, sau khi chưa chạm vào đất, có thể trở thành nguội lạnh. Cũng vậy, này các Tỷ-kheo, Tỷ-kheo trong khi thực hành, suy nghĩ như sau: “Nếu cái này không có, cái này có thể không phải của ta. Nếu cái này sẽ không có, cái này sẽ không phải của ta…”. Vị ấy, do diệt tận năm hạ phần kiết sử, chứng được Tổn hại Bát-niết-bàn.</p>\n<p><a class='ref ttc' id='ttc6' href='#ttc6'>TTC 6</a>Nhưng ở đây, này các Tỷ-kheo, Tỷ-kheo trong khi thực hành suy nghĩ như sau: “Nếu cái này không có, cái này có thể không phải của ta. Nếu cái này sẽ không có, cái này sẽ không phải của ta…”. Vị ấy, do đoạn diệt năm hạ phần kiết sử, chứng được Vô hành Niết-bàn. Ví như, này các Tỷ-kheo, một cái bát bằng sắt được đốt cháy cả ngày và được đập đánh, một miếng vụn có thể văng ra, có thể bay lên, có thể rơi xuống trên một đống cỏ nhỏ, hay trên một đống củi nhỏ; miếng vụn ấy ở đấy sanh ra ngọn lửa, sanh ra khói. Sau khi sanh ra ngọn lửa, sau khi sanh ra khói, nó đốt cháy tiêu hết đồng cỏ nhỏ ấy, hay đống củi nhỏ ấy, rồi trở thành nguội lạnh vì không có nhiên liệu. Cũng vậy, này các Tỷ-kheo, Tỷ-kheo trong khi thực hành, suy nghĩ như sau: “Nếu cái này không có, cái này có thể không phải của ta. Nếu cái này sẽ không có, cái này sẽ không phải của ta…”. Vị ấy, do đoạn diệt năm hạ phần kiết sử, chứng được Vô hành Niết-bàn.</p>\n<p><a class='ref ttc' id='ttc7' href='#ttc7'>TTC 7</a>Nhưng ở đây, này các Tỷ-kheo, vị Tỷ-kheo khi thực hành như vậy, suy nghĩ như sau: “Nếu cái này không có, cái này có thể không phải của ta. Nếu cái này sẽ không có, cái này sẽ không phải của ta…”. Vị ấy, do diệt tận năm hạ phần kiết sử, chứng được Hữu hành Bát-niết-bàn. Ví như, này các Tỷ-kheo, một cái bát bằng sắt được đốt cháy cả ngày và được đập đánh, một miếng vụn có thể văng ra, có thể bay lên, có thể rơi xuống trên một đống cỏ , hay trên một đống củi rộng lớn; miếng vụn ấy ở đấy sanh ra ngọn lửa, sanh ra khói. Sau khi sanh ra ngọn lửa, sau khi sanh ra khói, nó đốt cháy tiêu hết đồng cỏ , hay đống củi rộng lớn ấy, rồi trở thành nguội lạnh vì không có nhiên liệu. Cũng vậy, này các Tỷ-kheo, Tỷ-kheo trong khi thực hành như vậy, suy nghĩ như sau: “Nếu cái này không có, cái này sẽ không phải của ta. Nếu cái này sẽ không có, cái này sẽ không phải của ta…”. Vị ấy, do diệt tận năm hạ phần kiết sử, chứng được Hữu hành Bát-niết-bàn.</p>\n<p><a class='ref ttc' id='ttc8' href='#ttc8'>TTC 8</a>Ở đây, này các Tỷ-kheo, Tỷ-kheo trong khi thực hành như vậy suy nghĩ như sau: “Nếu cái này không có, cái này có thể không phải của ta. Nếu cái này sẽ không có, cái này sẽ không phải của ta. Cái gì có, cái gì được thành, ta đều từ bỏ.”. Vị ấy có được xả, vị ấy không tham đắm sanh hữu, không tham đắm tích tụ của hữu; với chánh trí tuệ, vị ấy thấy có con đường vô thượng tịch tịnh và vị ấy chưa chứng ngộ trọn vẹn hoàn toàn con đường ấy. Vị ấy chưa đoạn tận trọn vẹn hoàn toàn mạn tùy miên. Vị ấy chưa đoạn tận trọn vẹn hoàn toàn hữu tham tùy miên. Vị ấy chưa đoạn tận trọn vẹn hoàn toàn vô minh tùy miên. Do diệt tận năm hạ phần kiết sử, vị ấy chứng được Thượng lưu Bát-niết-bàn, đi đến Sắc cứu cánh. Ví như, này các Tỷ-kheo, một cái bát bằng sắt được đốt cháy cả ngày và được đập đánh, một miếng vụn có thể văng ra, có thể bay lên, có thể rơi xuống trên một đống cỏ, hay trên một đống củi to lớn; miếng vụn ấy ở đấy sanh ra ngọn lửa, sanh ra khói. Sau khi sanh ra ngọn lửa, sau khi sanh ra khói, nó đốt cháy tiêu hết đồng cỏ, hay đống củi to lớn ấy, thiêu cháy lùm cây, thiêu cháy rừng rậm. Sau khi thiêu cháy thảo nguyên, sau khi thiêu cháy rừng rậm, nó cháy lan đến đám ruộng xanh hay đến đám đất cao, hay đến hòn đá, hay đến dòng nước, hay đến đám đất khả ái, hay đến một phần đất nào rồi trở thành nguội lạnh vì không có nhiên liệu. Cũng vậy, này các Tỷ-kheo, Tỷ-kheo trong khi thực hành như vậy, suy nghĩ như sau: “Nếu cái này không có, cái này có thể không phải của ta. Nếu cái này sẽ không có, cái này sẽ không phải của ta…”. Vị ấy, do diệt tận năm hạ phần kiết sử, chứng được Thượng lưu Bát-niết-bàn, đi đến Sắc cứu cánh.</p>\n<p>Này các Tỷ-kheo, đây là bảy sanh thú của loài Người. Và này các Tỷ-kheo, thế nào là Không chấp thủ Bát-Niết-bàn?</p>\n<p><a class='ref ttc' id='ttc9' href='#ttc9'>TTC 9</a>Ở đây, này các Tỷ-kheo, vị Tỷ-kheo khi thực hành như vậy, suy nghĩ như sau: “Nếu cái này không có, cái này có thể không phải của ta. Nếu cái này sẽ không có, cái này sẽ không phải của ta. Cái gì có, cái gì được thành, ta đều từ bỏ.”. Vị ấy có được xả, vị ấy không tham đắm sanh hữu, không tham đắm tích tụ của hữu; với chánh trí tuệ, vị ấy thấy có con đường vô thượng tịch tịnh và vị ấy chứng đắc trọn vẹn hoàn toàn con đường ấy. Vị ấy chưa đoạn tận trọn vẹn hoàn toàn mạn tùy miên. Vị ấy chưa đoạn tận trọn vẹn hoàn toàn hữu tham tùy miên. Vị ấy chưa đoạn tận trọn vẹn hoàn toàn vô minh tùy miên. Do diệt tận năm hạ phần kiết sử, vị ấy tự mình với thắng trí, ngay trong hiện tại, chứng nhập, chứng đạt và an trú vô lậu tâm giải thoát, tuệ giải thoát. Này các Tỷ-kheo, đây gọi là Không chấp thủ Bát-niết-bàn. Và này các Tỷ-kheo, đây là bảy sanh thú của loài Người và Không chấp thủ Bát-niết-bàn.</p>\n<footer>\n<p>Bộ kinh nầy được <span class='author'>Hòa thượng Thích Minh Châu</span> dịch từ tạng Pali sang Việt ngữ năm 1976–1977, và được Viện Phật Học Vạn Hạnh, Sài Gòn, ấn hành năm <span class='publication-date'>1980–1981</span>. Trong chương trình phiên dịch và ấn hành Ðại tạng kinh Việt Nam, bộ kinh được hiệu đính thành 4 tập và tái bản năm 1996, qua số thứ tự 21, 22, 23, và 24.</p>\n<p>These texts have been used with the kind permission of the webmaster of <a href='http://www.budsas.net/'>http://www.budsas.net/</a></p>\n<p>Prepared for SuttaCentral by <span class='editor'>Ayya Vimala</span>.</p>\n</footer>\n</article>\n</body>\n</html>\n"
  },
  "translation": {
    "uid": "an7.55",
    "lang": "vi",
    "is_root": false,
    "title": "Sanh Thú Của Loài Người",
    "author": "Thích Minh Châu",
    "author_short": "Minh Châu",
    "author_uid": "minh_chau",
    "next": {
      "author_uid": "minh_chau",
      "lang": "vi",
      "name": "Tissa the Divinity ",
      "uid": "an7.56"
    },
    "previous": {
      "author_uid": "minh_chau",
      "lang": "vi",
      "name": "The Undeclared Points ",
      "uid": "an7.54"
    },
    "text": "<!DOCTYPE html>\n<html>\n<head>\n<meta charset='UTF-8'>\n<meta name='author' content='Thích Minh Châu'>\n<title></title>\n</head>\n<body>\n<article id='an7.55' lang='vi'>\n<header>\n<ul>\n<li class='division' lang='pli' translate='no'>Aṅguttara Nikāya</li>\n<li><span class='roman-numerals'>VI</span>. Phẩm Không Tuyên Bố</li>\n</ul>\n<h1>7.55. Sanh Thú Của Loài Người</h1>\n</header>\n<p><a class='ref ttc' id='ttc1' href='#ttc1'>TTC 1</a>—Này các Tỷ-kheo, Ta sẽ giảng về bảy sanh thú của loài Người, và không chấp thủ Niết-bàn. Hãy lắng nghe và suy nghiệm kỹ, Ta sẽ nói:</p>\n<p>—Thưa vâng, bạch Thế Tôn.</p>\n<p>Các Tỷ-kheo ấy vâng đáp Thế Tôn. Thế Tôn nói như sau:</p>\n<p>—Này các Tỷ-kheo. Thế nào là bảy sanh thú của loài Người?</p>\n<p><a class='ref ttc' id='ttc2' href='#ttc2'>TTC 2</a>Ở đây, này các Tỷ-kheo, Tỷ-kheo trong khi thực hành như vậy suy nghĩ như sau: “Nếu cái này không có, cái này có thể không phải của ta. Nếu cái này sẽ không có, cái này sẽ không phải của ta. Cái gì có, cái gì được thành, ta đều từ bỏ”. Vị ấy có được xả. Vị ấy không tham đắm sanh hữu, không tham đắm tích tụ của hữu; với chánh trí tuệ, vị ấy thấy có con đường vô thượng tịch tịnh. Vị ấy chưa chứng ngộ trọn vẹn hoàn toàn con đường ấy. Vị ấy chưa đoạn tận trọn vẹn hoàn toàn mạn tùy miên. Vị ấy chưa đoạn tận trọn vẹn hoàn toàn hữu tham tùy miên. Vị ấy chưa đoạn tận trọn vẹn hoàn toàn vô minh tùy miên. Do diệt tận năm hạ phần kiết sử, vị ấy chứng được Trung gian Niết-bàn. Ví như, này các Tỷ-kheo, một cái bát bằng sắt được đốt cháy cả ngày và được đập đánh, một miếng vụn có thể văng ra và trở thành nguội lạnh. Cũng vậy, này các Tỷ-kheo, Tỷ-kheo trong khi thực hành, suy nghĩ như sau: “Nếu cái này không có, cái này có thể không phải của ta. Nếu cái này sẽ không có, cái này sẽ không phải của ta. Cái gì có, cái gì được thành, ta đều từ bỏ”. Vị ấy có được xả, vị ấy không tham đắm hữu, không tham đắm hậu hữu; với chánh trí tuệ, vị ấy thấy có con đường vô thượng tịch tịnh. Và vị ấy chưa chứng ngộ trọn vẹn hoàn toàn con đường ấy. Vị ấy chưa đoạn tận trọn vẹn hoàn toàn mạn tùy miên. Vị ấy chưa đoạn tận trọn vẹn hoàn toàn hữu tham tùy miên. Vị ấy chưa đoạn tận trọn vẹn hoàn toàn vô minh tùy miên. Do diệt tận năm hạ phần kiết sử, vị ấy chứng được Trung gian Niết-bàn.</p>\n<p><a class='ref ttc' id='ttc3' href='#ttc3'>TTC 3</a>Ở đây, này các Tỷ-kheo, Tỷ-kheo trong thực hành suy nghĩ như sau: “Nếu cái này không có, cái này có thể không phải của ta. Nếu cái này sẽ không có, cái này sẽ không phải của ta. Cái gì có, cái gì được thành, ta đều từ bỏ”. Vị ấy có được xả, vị ấy không tham đắm sanh hữu, không tham đắm tích tụ của hữu; với chánh trí tuệ, vị ấy thấy có con đường vô thượng tịch tịnh và vị ấy chưa chứng ngộ trọn vẹn hoàn toàn con đường ấy. Vị ấy chưa đoạn tận trọn vẹn hoàn toàn mạn tùy miên. Vị ấy chưa đoạn tận trọn vẹn hoàn toàn hữu tham tùy miên. Vị ấy chưa đoạn tận trọn vẹn hoàn toàn vô minh tùy miên. Do diệt tận năm hạ phần kiết sử, vị ấy chứng được Trung gian Niết-bàn. Ví như, này các Tỷ-kheo, một cái bát bằng sắt được đốt cháy cả ngày và được đập đánh, một miếng vụn có thể văng ra, có thể bay lên và trở thành nguội lạnh. Cũng vậy, này các Tỷ-kheo, Tỷ-kheo trong khi thực hành, suy nghĩ như sau: “Nếu cái này không có, cái này có thể không phải của ta. Nếu cái này sẽ không có, cái này sẽ không phải của ta…”. Vị ấy đoạn diệt tận năm hạ phần kiết sử, vị ấy chứng được Trung gian Niết-bàn.</p>\n<p><a class='ref ttc' id='ttc4' href='#ttc4'>TTC 4</a>Nhưng ở đây, này các Tỷ-kheo, Tỷ-kheo trong khi thực hành suy nghĩ như sau: “Nếu cái này không có, cái này có thể không phải của ta. Nếu cái này sẽ không có, cái này sẽ không phải của ta…”. Vị ấy đoạn diệt tận năm hạ phần kiết sử, vị ấy chứng được Trung gian Niết-bàn. Ví như, này các Tỷ-kheo, một cái bát bằng sắt được đốt cháy cả ngày và được đập đánh, một miếng vụn có thể văng ra, có thể bay lên, sau khi chưa chạm vào đất, có thể trở thành nguội lạnh. Cũng vậy, này các Tỷ-kheo, Tỷ-kheo trong khi thực hành, suy nghĩ như sau: “Nếu cái này không có, cái này có thể không phải của ta. Nếu cái này sẽ không có, cái này sẽ không phải của ta…”. Vị ấy, sau khi diệt tận năm hạ phần kiết sử, vị ấy chứng được Trung gian Niết-bàn.</p>\n<p><a class='ref ttc' id='ttc5' href='#ttc5'>TTC 5</a>Nhưng ở đây, này các Tỷ-kheo, Tỷ-kheo trong khi thực hành, suy nghĩ như sau: “Nếu cái này không có, cái này có thể không phải của ta. Nếu cái này sẽ không có, cái này sẽ không phải của ta…”. Vị ấy, do diệt tận năm hạ phần kiết sử, chứng được Tổn hại Bát-niết-bàn. Ví như, này các Tỷ-kheo, một cái bát bằng sắt được đốt cháy cả ngày và được đập đánh, một miếng vụn có thể văng ra , có thể bay lên, sau khi chưa chạm vào đất, có thể trở thành nguội lạnh. Cũng vậy, này các Tỷ-kheo, Tỷ-kheo trong khi thực hành, suy nghĩ như sau: “Nếu cái này không có, cái này có thể không phải của ta. Nếu cái này sẽ không có, cái này sẽ không phải của ta…”. Vị ấy, do diệt tận năm hạ phần kiết sử, chứng được Tổn hại Bát-niết-bàn.</p>\n<p><a class='ref ttc' id='ttc6' href='#ttc6'>TTC 6</a>Nhưng ở đây, này các Tỷ-kheo, Tỷ-kheo trong khi thực hành suy nghĩ như sau: “Nếu cái này không có, cái này có thể không phải của ta. Nếu cái này sẽ không có, cái này sẽ không phải của ta…”. Vị ấy, do đoạn diệt năm hạ phần kiết sử, chứng được Vô hành Niết-bàn. Ví như, này các Tỷ-kheo, một cái bát bằng sắt được đốt cháy cả ngày và được đập đánh, một miếng vụn có thể văng ra, có thể bay lên, có thể rơi xuống trên một đống cỏ nhỏ, hay trên một đống củi nhỏ; miếng vụn ấy ở đấy sanh ra ngọn lửa, sanh ra khói. Sau khi sanh ra ngọn lửa, sau khi sanh ra khói, nó đốt cháy tiêu hết đồng cỏ nhỏ ấy, hay đống củi nhỏ ấy, rồi trở thành nguội lạnh vì không có nhiên liệu. Cũng vậy, này các Tỷ-kheo, Tỷ-kheo trong khi thực hành, suy nghĩ như sau: “Nếu cái này không có, cái này có thể không phải của ta. Nếu cái này sẽ không có, cái này sẽ không phải của ta…”. Vị ấy, do đoạn diệt năm hạ phần kiết sử, chứng được Vô hành Niết-bàn.</p>\n<p><a class='ref ttc' id='ttc7' href='#ttc7'>TTC 7</a>Nhưng ở đây, này các Tỷ-kheo, vị Tỷ-kheo khi thực hành như vậy, suy nghĩ như sau: “Nếu cái này không có, cái này có thể không phải của ta. Nếu cái này sẽ không có, cái này sẽ không phải của ta…”. Vị ấy, do diệt tận năm hạ phần kiết sử, chứng được Hữu hành Bát-niết-bàn. Ví như, này các Tỷ-kheo, một cái bát bằng sắt được đốt cháy cả ngày và được đập đánh, một miếng vụn có thể văng ra, có thể bay lên, có thể rơi xuống trên một đống cỏ , hay trên một đống củi rộng lớn; miếng vụn ấy ở đấy sanh ra ngọn lửa, sanh ra khói. Sau khi sanh ra ngọn lửa, sau khi sanh ra khói, nó đốt cháy tiêu hết đồng cỏ , hay đống củi rộng lớn ấy, rồi trở thành nguội lạnh vì không có nhiên liệu. Cũng vậy, này các Tỷ-kheo, Tỷ-kheo trong khi thực hành như vậy, suy nghĩ như sau: “Nếu cái này không có, cái này sẽ không phải của ta. Nếu cái này sẽ không có, cái này sẽ không phải của ta…”. Vị ấy, do diệt tận năm hạ phần kiết sử, chứng được Hữu hành Bát-niết-bàn.</p>\n<p><a class='ref ttc' id='ttc8' href='#ttc8'>TTC 8</a>Ở đây, này các Tỷ-kheo, Tỷ-kheo trong khi thực hành như vậy suy nghĩ như sau: “Nếu cái này không có, cái này có thể không phải của ta. Nếu cái này sẽ không có, cái này sẽ không phải của ta. Cái gì có, cái gì được thành, ta đều từ bỏ.”. Vị ấy có được xả, vị ấy không tham đắm sanh hữu, không tham đắm tích tụ của hữu; với chánh trí tuệ, vị ấy thấy có con đường vô thượng tịch tịnh và vị ấy chưa chứng ngộ trọn vẹn hoàn toàn con đường ấy. Vị ấy chưa đoạn tận trọn vẹn hoàn toàn mạn tùy miên. Vị ấy chưa đoạn tận trọn vẹn hoàn toàn hữu tham tùy miên. Vị ấy chưa đoạn tận trọn vẹn hoàn toàn vô minh tùy miên. Do diệt tận năm hạ phần kiết sử, vị ấy chứng được Thượng lưu Bát-niết-bàn, đi đến Sắc cứu cánh. Ví như, này các Tỷ-kheo, một cái bát bằng sắt được đốt cháy cả ngày và được đập đánh, một miếng vụn có thể văng ra, có thể bay lên, có thể rơi xuống trên một đống cỏ, hay trên một đống củi to lớn; miếng vụn ấy ở đấy sanh ra ngọn lửa, sanh ra khói. Sau khi sanh ra ngọn lửa, sau khi sanh ra khói, nó đốt cháy tiêu hết đồng cỏ, hay đống củi to lớn ấy, thiêu cháy lùm cây, thiêu cháy rừng rậm. Sau khi thiêu cháy thảo nguyên, sau khi thiêu cháy rừng rậm, nó cháy lan đến đám ruộng xanh hay đến đám đất cao, hay đến hòn đá, hay đến dòng nước, hay đến đám đất khả ái, hay đến một phần đất nào rồi trở thành nguội lạnh vì không có nhiên liệu. Cũng vậy, này các Tỷ-kheo, Tỷ-kheo trong khi thực hành như vậy, suy nghĩ như sau: “Nếu cái này không có, cái này có thể không phải của ta. Nếu cái này sẽ không có, cái này sẽ không phải của ta…”. Vị ấy, do diệt tận năm hạ phần kiết sử, chứng được Thượng lưu Bát-niết-bàn, đi đến Sắc cứu cánh.</p>\n<p>Này các Tỷ-kheo, đây là bảy sanh thú của loài Người. Và này các Tỷ-kheo, thế nào là Không chấp thủ Bát-Niết-bàn?</p>\n<p><a class='ref ttc' id='ttc9' href='#ttc9'>TTC 9</a>Ở đây, này các Tỷ-kheo, vị Tỷ-kheo khi thực hành như vậy, suy nghĩ như sau: “Nếu cái này không có, cái này có thể không phải của ta. Nếu cái này sẽ không có, cái này sẽ không phải của ta. Cái gì có, cái gì được thành, ta đều từ bỏ.”. Vị ấy có được xả, vị ấy không tham đắm sanh hữu, không tham đắm tích tụ của hữu; với chánh trí tuệ, vị ấy thấy có con đường vô thượng tịch tịnh và vị ấy chứng đắc trọn vẹn hoàn toàn con đường ấy. Vị ấy chưa đoạn tận trọn vẹn hoàn toàn mạn tùy miên. Vị ấy chưa đoạn tận trọn vẹn hoàn toàn hữu tham tùy miên. Vị ấy chưa đoạn tận trọn vẹn hoàn toàn vô minh tùy miên. Do diệt tận năm hạ phần kiết sử, vị ấy tự mình với thắng trí, ngay trong hiện tại, chứng nhập, chứng đạt và an trú vô lậu tâm giải thoát, tuệ giải thoát. Này các Tỷ-kheo, đây gọi là Không chấp thủ Bát-niết-bàn. Và này các Tỷ-kheo, đây là bảy sanh thú của loài Người và Không chấp thủ Bát-niết-bàn.</p>\n<footer>\n<p>Bộ kinh nầy được <span class='author'>Hòa thượng Thích Minh Châu</span> dịch từ tạng Pali sang Việt ngữ năm 1976–1977, và được Viện Phật Học Vạn Hạnh, Sài Gòn, ấn hành năm <span class='publication-date'>1980–1981</span>. Trong chương trình phiên dịch và ấn hành Ðại tạng kinh Việt Nam, bộ kinh được hiệu đính thành 4 tập và tái bản năm 1996, qua số thứ tự 21, 22, 23, và 24.</p>\n<p>These texts have been used with the kind permission of the webmaster of <a href='http://www.budsas.net/'>http://www.budsas.net/</a></p>\n<p>Prepared for SuttaCentral by <span class='editor'>Ayya Vimala</span>.</p>\n</footer>\n</article>\n</body>\n</html>\n"
  },
  "segmented": false,
  "suttaplex": {
    "acronym": "AN 7.55",
    "volpages": " PTS 4.71, PTS 4.72, PTS 4.73, PTS 4.74",
    "alt_volpages": null,
    "uid": "an7.55",
    "blurb": "Seven kinds of rebirth for non-returners, as well as extinguishment by not grasping.",
    "difficulty": null,
    "original_title": "Purisagatisutta",
    "root_lang": "pli",
    "root_lang_name": "Pāli",
    "type": "leaf",
    "from": null,
    "translated_title": "Sanh Thú Của Loài Người",
    "translations": [
      {
        "lang": "de",
        "lang_name": "Deutsch",
        "is_root": false,
        "author": "Sabbamitta",
        "author_short": "sabbamitta",
        "author_uid": "sabbamitta",
        "publication_date": "2019",
        "id": "an7.55_translation-de-sabbamitta",
        "segmented": true,
        "title": "Bestimmungsorte von Menschen ",
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "en",
        "lang_name": "English",
        "is_root": false,
        "author": "Bhikkhu Sujato",
        "author_short": "sujato",
        "author_uid": "sujato",
        "publication_date": "2018",
        "id": "an7.55_translation-en-sujato",
        "segmented": true,
        "title": "Places People Are Reborn ",
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "pli",
        "lang_name": "Pāli",
        "is_root": true,
        "author": "Mahāsaṅgīti Tipiṭaka Buddhavasse 2500",
        "author_short": "ms",
        "author_uid": "ms",
        "publication_date": null,
        "id": "an7.55_root-pli-ms",
        "segmented": true,
        "title": null,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "ru",
        "lang_name": "Русский",
        "is_root": false,
        "author": "SV theravada.ru",
        "author_short": "sv",
        "author_uid": "sv",
        "publication_date": "2025",
        "id": "an7.55_translation-ru-sv",
        "segmented": true,
        "title": "Сутта Уделы личностей",
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "bn",
        "lang_name": "বাংলা",
        "is_root": false,
        "author": "সুমঙ্গল বড়ুয়া",
        "author_short": "বড়ুয়া",
        "author_uid": "sumangal-barua",
        "publication_date": "2018",
        "id": "bn_an7.55_sumangal-barua",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "de",
        "lang_name": "Deutsch",
        "is_root": false,
        "author": "Nyānatiloka Thera",
        "author_short": "Nyanatiloka",
        "author_uid": "nyanatiloka",
        "publication_date": "1907",
        "id": "de_an7.55_nyanatiloka",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "es",
        "lang_name": "Español",
        "is_root": false,
        "author": "Isidatta",
        "author_short": "Isidatta",
        "author_uid": "isidatta",
        "publication_date": "2014",
        "id": "es_an7.55_isidatta",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "id",
        "lang_name": "Bahasa Indonesia",
        "is_root": false,
        "author": "Indra Anggara",
        "author_short": "Anggara",
        "author_uid": "anggara",
        "publication_date": null,
        "id": "id_an7.55_anggara",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "jpn",
        "lang_name": "日本語",
        "is_root": false,
        "author": "関西パーリ語実習会",
        "author_short": "関西パーリ語実習会",
        "author_uid": "kansai",
        "publication_date": "2023",
        "id": "jpn_an7.55_kansai",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "my",
        "lang_name": "မြန်မာဘာသာ",
        "is_root": false,
        "author": "Pitaka Myanmar Translation",
        "author_short": "PMT",
        "author_uid": "pmt",
        "publication_date": null,
        "id": "my_an7.55_pmt",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "pt",
        "lang_name": "Português",
        "is_root": false,
        "author": "Michael Beisert",
        "author_short": "Beisert",
        "author_uid": "beisert",
        "publication_date": "2013",
        "id": "pt_an7.55_beisert",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "ru",
        "lang_name": "Русский",
        "is_root": false,
        "author": "SV",
        "author_short": "SV",
        "author_uid": "sv",
        "publication_date": "2014",
        "id": "ru_an7.55_sv",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "si",
        "lang_name": "සිංහල",
        "is_root": false,
        "author": "A.P. de Zoysa",
        "author_short": "Zoysa",
        "author_uid": "zoysa",
        "publication_date": null,
        "id": "si_an7.55_zoysa",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "th",
        "lang_name": "ไทย",
        "is_root": false,
        "author": "Siam Rath",
        "author_short": "Siam Rath",
        "author_uid": "siam_rath",
        "publication_date": null,
        "id": "th_an7.55_siam_rath",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "author": "Thích Minh Châu",
        "author_short": "Minh Châu",
        "author_uid": "minh_chau",
        "has_comment": false,
        "id": "vi_an7.55_minh_chau",
        "is_root": false,
        "lang": "vi",
        "lang_name": "Tiếng Việt",
        "publication_date": "1980–1981",
        "segmented": false,
        "volpage": null,
        "title": "Sanh Thú Của Loài Người"
      },
      {
        "lang": "zh",
        "lang_name": "汉语",
        "is_root": false,
        "author": "莊春江",
        "author_short": "莊春江",
        "author_uid": "zhuang",
        "publication_date": null,
        "id": "zh_an7.55_zhuang",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      }
    ],
    "parallel_count": 1,
    "biblio": null,
    "priority_author_uid": null,
    "verseNo": "bj21.384, ms16A7_335, msdiv55, vri38.213,csp1ed16.450, csp2ed16.450, dr23.79, ms16A7_336, pts-vp-pli4.71,bj21.386, dr23.80, ms16A7_337, ndp18.207,csp1ed16.451, csp2ed16.451, ms16A7_338, pts-vp-pli4.72, vri38.214,ms16A7_339,dr23.81, ms16A7_340, ndp18.208,bj21.388, csp1ed16.452, csp2ed16.452, ms16A7_341, pts-vp-pli4.73, vri38.215,dr23.82, ms16A7_342, pts-vp-pli4.74,ms16A7_343, ndp18.209",
    "previous": {
      "name": null,
      "uid": null
    },
    "next": {
      "name": null,
      "uid": null
    }
  },
  "bilara_root_text": {
    "uid": "an7.55",
    "author": "Mahāsaṅgīti Tipiṭaka Buddhavasse 2500",
    "author_short": "ms",
    "author_uid": "ms",
    "lang": "pli",
    "title": "Purisagatisutta",
    "previous": {
      "author_uid": "ms",
      "lang": "pli",
      "name": null,
      "uid": null
    },
    "next": {
      "author_uid": "ms",
      "lang": "pli",
      "name": null,
      "uid": null
    }
  },
  "bilara_translated_text": null,
  "candidate_authors": [
    "sujato"
  ]
}