{
  "root_text": {
    "uid": "an8.30",
    "lang": "vi",
    "is_root": false,
    "title": "Tôn Giả Anuruddha",
    "author": "Thích Minh Châu",
    "author_short": "Minh Châu",
    "author_uid": "minh_chau",
    "next": {
      "author_uid": "minh_chau",
      "lang": "vi",
      "name": "Giving (1st) ",
      "uid": "an8.31"
    },
    "previous": {
      "author_uid": "minh_chau",
      "lang": "vi",
      "name": "Lost Opportunities ",
      "uid": "an8.29"
    },
    "text": "<!DOCTYPE html>\n<html>\n<head>\n<meta charset='UTF-8'>\n<meta name='author' content='Thích Minh Châu'>\n<title></title>\n</head>\n<body>\n<article id='an8.30' lang='vi'>\n<header>\n<ul>\n<li class='division' lang='pli' translate='no'>Aṅguttara Nikāya</li>\n<li><span class='roman-numerals'>III</span>. Phẩm Gia Chủ</li>\n</ul>\n<h1>8.30. Tôn Giả Anuruddha</h1>\n</header>\n<p><a class='ref ttc' id='ttc1' href='#ttc1'>TTC 1</a>Một thời, Thế Tôn trú ở giữa dân chúng Bhagga, tại núi Sumsumàra, rừng Bhesakala, vườn Lộc Uyển. Lúc bấy giờ, Tôn giả Anuruddha (A-nậu-lâu-đà) sống giữa dân chúng Celì, tại Pàcìnavamsadàya, Rồi Tôn giả Anuruddha, trong khi sống độc cư … Thiền tịnh, tâm tư khởi lên như sau: “Pháp này để cho người ít dục, pháp này không phải để cho người nhiều dục; Pháp này để cho người biết đủ, pháp này không phải để cho người không biết đủ; Pháp này để cho người sống thanh vắng, pháp này không phải để cho người ưa hội chúng; Pháp này để cho người tinh cần tinh tấn, pháp này không phải để cho người biếng nhác; Pháp này để cho người trú niệm, pháp này không phải để cho người thất niệm; Pháp này để cho người Thiền định, pháp này không phải để cho người không Thiền định; Pháp này để cho người có trí tuệ, pháp này không phải để cho người ác tuệ”.</p>\n<p><a class='ref ttc' id='ttc2' href='#ttc2'>TTC 2</a>Rồi Thế Tôn với tâm của mình rõ biết tâm tư của Tôn giả Anuruddha, ví như người lực sĩ duỗi bàn tay đang co lại; hay co lại bàn tay đang duỗi ra; cũng vậy, Thế Tôn biến mất ở giữa dân chúng Bhagga, tại núi Sumsumàra, rừng Bhesakalà, vườn Lộc Uyển, và hiện ra giữa dân chúng Celì, tại Pàcìnavamsadàya, trước mặt Tôn giả Anuruddha. Thế Tôn ngồi xuống trên chỗ đã soạn sẵn. Rồi Thế Tôn nói với Tôn giả Anuruddha đang ngồi một bên:</p>\n<p><a class='ref ttc' id='ttc3' href='#ttc3'>TTC 3</a>—Lành thay, lành thay, này Anuruddha! Lành thay, này Anuruddha, Thầy đã suy nghĩ đến bảy niệm của bậc Ðại nhân: “ Pháp này để cho người ít dục, pháp này không phải để cho người nhiều dục; Pháp này để cho người biết đủ, pháp này không phải để cho người không biết đủ; Pháp này để cho người sống thanh vắng, pháp này không phải để cho người ưa hội chúng; Pháp này để cho người tinh cần tinh tấn, pháp này không phải để cho người biếng nhác; Pháp này để cho người trú niệm, pháp này không phải để cho người thất niệm; Pháp này để cho người Thiền định, pháp này không phải để cho người không Thiền định; Pháp này để cho người có trí tuệ, pháp này không phải để cho người ác tuệ”.</p>\n<p>Do vậy, này Anuruddha, hãy suy nghĩ đến niệm thứ tám này của bậc Ðại nhân: “Pháp này để cho người không ưa hý luận, không thích hý luận, Pháp này không phải để cho người ưa hý luận, thích hý luận “.</p>\n<p><a class='ref ttc' id='ttc4' href='#ttc4'>TTC 4</a>Khi nào, này Anuruddha, Thầy sẽ suy nghĩ đến tám tư niệm này của bậc Ðại nhân, thời nếu Thầy muốn, Thầy sẽ chứng đạt và an trú Thiền thứ nhất, một trạng thái hỷ lạc do ly dục sanh, có tầm có tứ.</p>\n<p><a class='ref ttc' id='ttc5' href='#ttc5'>TTC 5</a>Khi nào, này Anuruddha, Thầy sẽ suy nghĩ đến tám tư niệm này của bậc Ðại nhân, thời nếu Thầy muốn, diệt tầm diệt tứ, Thầy sẽ chứng đạt và an trú Thiền thứ hai, một trạng thái hỷ lạc do định sanh, không tầm không tứ, nội tĩnh nhất tâm.</p>\n<p><a class='ref ttc' id='ttc6' href='#ttc6'>TTC 6</a>Khi nào, này Anuruddha, khi nào Thầy sẽ suy nghĩ đến tám tư niệm này của bậc Ðại nhân, thời nếu Thầy muốn, Thầy sẽ ly hỷ trú xả, chánh niệm tỉnh giác, thân cảm sự lạc thọ mà các bậc Thánh gọi là “xả niệm lạc trú”, chứng và an trú Thiền thứ ba.</p>\n<p><a class='ref ttc' id='ttc7' href='#ttc7'>TTC 7</a>Khi nào, này Anuruddha, Thầy sẽ suy nghĩ đến tám tư niệm này của bậc Ðại nhân, thời nếu Thầy muốn, Thầy sẽ xả lạc xả khổ, diệt hỷ ưu đã cảm thọ trước, chứng và an trú Thiền thứ tư, không khổ, không lạc, xả niệm thanh tịnh.</p>\n<p><a class='ref ttc' id='ttc8' href='#ttc8'>TTC 8</a>Khi nào, này Anuruddha, Thầy sẽ suy nghĩ đến tám tư niệm này của bậc Ðại nhân, khi nào bốn Thiền này thuộc tăng thượng tâm, hiện tại lạc trú, chứng được không khó khăn, chứng được không mệt nhọc, chứng được không phí sức, thời này Anuruddha, tấm y lượm từ đống rác lên của Thầy sẽ giống như tủ áo đầy những vải có nhiều màu sắc của người gia chủ hay con người gia chủ, để được sống biết đủ, ưa thích, không có lo âu, được lạc trú, được bước vào Niết-bàn.</p>\n<p><a class='ref ttc' id='ttc9' href='#ttc9'>TTC 9</a>Khi nào, này Anuruddha, Thầy sẽ suy nghĩ đến tám tư niệm này của bậc Ðại nhân, thời nếu Thầy muốn, khi nào bốn Thiền này thuộc tăng thượng tâm, hiện tại lạc trú, chứng được không khó khăn, chứng được không mệt nhọc, chứng được không phí sức, thời này Anuruddha, các món ăn từng miếng Thầy khất thực được sẽ giống như món cơm bằng gạo trắng, các hạt đen đã được lượm sạch, với nhiều loại súp, với nhiều loại đồ ăn của người gia chủ, hay của con người gia chủ, để được sống biết đủ, ưa thích, không có lo âu, được lạc trú, được bước vào Niết-bàn.</p>\n<p><a class='ref ttc' id='ttc10' href='#ttc10'>TTC 10</a>Khi nào, này Anuruddha, Thầy sẽ suy nghĩ đến tám tư niệm này của bậc Ðại nhân, khi nào bốn Thiền này thuộc tăng thượng tâm, hiện tại lạc trú, chứng được không khó khăn, chứng được không mệt nhọc, chứng được không phí sức, thời này Anuruddha, chỗ nằm dưới gốc cây thầy sẽ giống như nhà có nóc nhọn, có trét hồ trong ngoài, cửa được cài then, cửa sổ được đóng lại ngăn chặn gió của người gia chủ, hay của con người gia chủ, để được sống biết đủ, ưa thích, không có lo âu, được lạc trú, được bước vào Niết-bàn.</p>\n<p><a class='ref ttc' id='ttc11' href='#ttc11'>TTC 11</a>Khi nào, này Anuruddha, Thầy sẽ suy nghĩ đến tám tư niệm này của bậc Ðại nhân, khi nào bốn Thiền này thuộc tăng thượng tâm, hiện tại lạc trú, chứng được không khó khăn, chứng được không mệt nhọc, chứng được không phí sức, thời này Anuruddha, giường nằm và chỗ ngồi trải với đệm cỏ của Thầy sẽ giống như ghế dài, nệm trải giường nằm bằng len, chăn len trắng, chăn len thêu bông, nệm bằng da con sơn dương gọi là kadali, tấm thảm với đầu che phía trên, ghế dài có đầu gối chân màu đỏ của các người gia chủ, hay của con người gia chủ, để được sống biết đủ, ưa thích, không có lo âu, được lạc trú, được bước vào Niết-bàn.</p>\n<p><a class='ref ttc' id='ttc12' href='#ttc12'>TTC 12</a>Khi nào, này Anuruddha, Thầy sẽ suy nghĩ đến tám tư niệm này của bậc Ðại nhân, khi nào bốn Thiền này thuộc tăng thượng tâm, hiện tại lạc trú, chứng được không khó khăn, chứng được không mệt nhọc, chứng được không phí sức, thời này Anuruddha, dược phẩm nước tiểu hôi của Thầy sẽ giống như các loại dược phẩm của các người gia chủ, hay của con người gia chủ, như thục tô, sanh tô, dầu, mật, đường bánh, để được sống biết đủ, ưa thích, không có lo âu, được lạc trú, được bước vào Niết-bàn.</p>\n<p><a class='ref ttc' id='ttc13' href='#ttc13'>TTC 13</a>Vậy này Anuruddha, nhân kỳ an cư mùa mưa sắp đến, hãy trú giữa dân chúng Cetì ở Pàcìnavamsadàya.</p>\n<p>—Thưa vâng, bạch Thế Tôn.</p>\n<p>Tôn giả Anuruddha vâng đáp Thế Tôn. Rồi Thế Tôn sau khi khuyến giáo Tôn giả Anuruddha với lời khuyến giáo này, như người lực sĩ duỗi cánh tay đang co lại, hay co lại cánh tay đang duỗi ra; cũng vậy, Ngài biến mất giữa dân chúng Cetì ở Pàcìnavamsadàya và hiện ra giữa dân chúng Bhagga, trên núi Sumsumàra trong rừng Bhesakalà, vườn Lộc Uyển. Thế Tôn ngồi xuống trên chỗ đã soạn sẵn, sau khi ngồi xuống, Thế Tôn bảo các Tỷ-kheo:</p>\n<p><a class='ref ttc' id='ttc14' href='#ttc14'>TTC 14</a>—Này các Tỷ-kheo, Ta sẽ thuyết tám tư niệm của bậc Ðại nhân cho các Thầy. Hãy lắng nghe và khéo tư niệm, Ta sẽ giảng:</p>\n<p>—Thưa vâng, bạch Thế Tôn.</p>\n<p>Các Tỷ-kheo ấy vâng đáp Thế Tôn. Thế Tôn nói như sau:</p>\n<p>—Này các Tỷ-kheo, thế nào là tám tư niệm của bậc Ðại nhân?</p>\n<p><a class='ref ttc' id='ttc15' href='#ttc15'>TTC 15</a>Này các Tỷ-kheo, Pháp này để cho người ít dục, Pháp này không phải để cho người nhiều dục; Này các Tỷ kheo,Pháp này để cho người biết đủ, pháp này không phải để cho người không biết đủ; Này các Tỷ kheo, Pháp này để cho người sống thanh vắng, pháp này không phải để cho người ưa hội chúng; Này các Tỷ kheo, Pháp này để cho người tinh cần tinh tấn, pháp này không phải để cho người biếng nhác; Này các Tỷ kheo,Pháp này để cho người trú niệm, pháp này không phải để cho người thất niệm; Này các Tỷ kheo, Pháp này để cho người Thiền định, pháp này không phải để cho người không Thiền định; Này các Tỷ kheo, Pháp này để cho người có trí tuệ, Pháp này không phải để cho người ác tuệ; Này các Tỷ-kheo, Pháp này để cho người không ưa hý luận, không thích hý luận, Pháp này không phải để cho người ưa hý luận, thích hý luận.</p>\n<p><a class='ref ttc' id='ttc16' href='#ttc16'>TTC 16</a>Này các Tỷ-kheo, “Pháp này để cho người ít dục, Pháp này không để cho người có dục lớn”, như vậy đã được nói đến. Do duyên gì được nói như vậy?</p>\n<p><a class='ref ttc' id='ttc17' href='#ttc17'>TTC 17</a>Này các Tỷ-kheo, ở đây, Tỷ-kheo ít dục không muốn: “Mong người ta biết tôi là ít dục”; biết đủ, không muốn: “Mong người ta biết tôi là biết đủ”; sống viễn ly, không muốn: “Mong người ta biết tôi sống viễn ly”; tinh cần tinh tấn, không muốn: “Mong người ta biết tôi sống tinh cần tinh tấn”; trú niệm, không muốn: “Mong người ta biết tôi trú niệm”; có định, không muốn: “Mong người ta biết tôi có định”; có tuệ, không muốn: “Mong người ta biết tôi là người có tuệ “; không thích hý luận, không muốn: “Mong người ta biết tôi không thích hý luận”. Này các Tỷ-kheo, Pháp này để cho người ít dục, Pháp này không để cho người có dục lớn”, đã được nói đến như vậy. Do duyên này được nói như vậy.</p>\n<p><a class='ref ttc' id='ttc18' href='#ttc18'>TTC 18</a>Này các Tỷ-kheo, “Pháp này để cho người biết đủ, Pháp này không để cho người không biết đủ”, như vậy đã được nói đến. Do duyên gì được nói như vậy?</p>\n<p><a class='ref ttc' id='ttc19' href='#ttc19'>TTC 19</a>Ở đây, này các Tỷ-kheo, Tỷ-kheo biết đủ với bất cứ vật dụng gì như y áo, đồ ăn khất thực, sàng tọa, dược phẩm trị bệnh. Này các Tỷ-kheo, “Pháp này để cho người biết đủ, Pháp này không phải để cho người không biết đủ”, đã được nói đến như vậy. Do duyên này được nói như vậy.</p>\n<p><a class='ref ttc' id='ttc20' href='#ttc20'>TTC 20</a>Này các Tỷ-kheo, Pháp này để cho người sống viễn ly, “Pháp này không phải để cho người ưa thích hội chúng”, như vậy đã được nói đến. Do duyên gì được nói như vậy?</p>\n<p><a class='ref ttc' id='ttc21' href='#ttc21'>TTC 21</a>Ở đây, này các Tỷ-kheo, Với Tỷ-kheo sống viễn ly, có nhiều người đến thăm như Tỷ-kheo, Tỷ-kheo-Ni, nam cư sĩ, nữ cư sĩ, vua chúa, đại thần, các ngoại đạo sư, đệ tử của các ngoại đạo sư. Ở đây, Tỷ-kheo với tâm thuận về viễn ly, hướng về viễn ly, nhập vào viễn ly, trú vào viễn ly, thích thú xuất ly, nói lời hoàn toàn liên hệ đến lánh xa. Này các Tỷ-kheo, Pháp này để cho người viễn ly, “Pháp này không phải để cho người không ưa hội chúng”, đã được nói đến như vậy. Do duyên này được nói như vậy.</p>\n<p><a class='ref ttc' id='ttc22' href='#ttc22'>TTC 22</a>Này các Tỷ-kheo, Pháp này để cho người tinh cần tinh tấn, “Pháp này không phải để cho người biếng nhác”, như vậy đã được nói đến. Do duyên gì được nói như vậy?</p>\n<p><a class='ref ttc' id='ttc23' href='#ttc23'>TTC 23</a>Ở đây, này các Tỷ-kheo, Tỷ-kheo sống tinh cần tinh tấn, đoạn tận các pháp bất thiện, thành tựu các Pháp thiện, nỗ lực kiên trì, không từ bỏ gánh nặng đối với các thiện pháp. Này các Tỷ-kheo, Pháp này để cho người tinh cần tinh tấn, “Pháp này không phải để cho người biếng nhác”, đã được nói đến như vậy. Do duyên này được nói như vậy.</p>\n<p><a class='ref ttc' id='ttc24' href='#ttc24'>TTC 24</a>Này các Tỷ-kheo, Pháp này để cho người trú niệm, “Pháp này không phải để cho người thất niệm”, như vậy đã được nói đến. Do duyên gì được nói như vậy?</p>\n<p><a class='ref ttc' id='ttc25' href='#ttc25'>TTC 25</a>Ở đây, này các Tỷ-kheo, Tỷ-kheo đầy đủ niệm, thành tựu niệm tuệ tối thắng, ức nhớ tùy niệm những điều đã làm, nói đã lâu. Này các Tỷ-kheo, “Pháp này để cho người trú niệm, Pháp này không phải để cho người thất niệm”, đã được nói đến như vậy. Do duyên này được nói như vậy.</p>\n<p><a class='ref ttc' id='ttc26' href='#ttc26'>TTC 26</a>Này các Tỷ-kheo, Pháp này để cho người thiền định, “Pháp này không phải để cho người không thiền định”, như vậy đã được nói đến. Do duyên gì được nói như vậy?</p>\n<p><a class='ref ttc' id='ttc27' href='#ttc27'>TTC 27</a>Ở đây, này các Tỷ-kheo, Tỷ-kheo ly dục, ly ác pháp … chứng đạt và an trú Thiền thứ tư. Này các Tỷ-kheo, Pháp này để cho người thiền định, “Pháp này không phải để cho người không thiền định”, đã được nói đến như vậy. Do duyên này được nói như vậy.</p>\n<p><a class='ref ttc' id='ttc28' href='#ttc28'>TTC 28</a>Này các Tỷ-kheo, Pháp này để cho người có trí tuệ, “Pháp này không phải để cho người không trí tuệ”, như vậy đã được nói đến. Do duyên gì được nói như vậy?</p>\n<p><a class='ref ttc' id='ttc29' href='#ttc29'>TTC 29</a>Ở đây, này các Tỷ-kheo, Tỷ-kheo có trí tuệ, có trí tuệ về sanh diệt, thành tựu Thánh thể nhập (quyết trạch), đưa đến chơn chánh đoạn diệt khổ đau. Này các Tỷ-kheo, “Pháp này để cho người có trí tuệ, Pháp này không phải để cho người không trí tuệ”, đã được nói đến như vậy. Do duyên này được nói như vậy</p>\n<p><a class='ref ttc' id='ttc30' href='#ttc30'>TTC 30</a>Này các Tỷ-kheo, Pháp này để cho người không ưa hý luận, không thích hý luận, “Pháp này không phải để cho người ưa hý luận, thích hý luận”, như vậy đã được nói đến. Do duyên gì được nói như vậy?</p>\n<p><a class='ref ttc' id='ttc31' href='#ttc31'>TTC 31</a>Này các Tỷ-kheo, ở đây, Tỷ-kheo đối với đoạn diệt hý luận, tâm được phấn chấn, tịnh tín, an trú, hướng đến. Này các Tỷ-kheo, Pháp này để cho người không ưa hý luận, không thích hý luận, “Pháp này không phải để cho người ưa hý luận, thích hý luận”, đã được nói đến như vậy. Do duyên này được nói như vậy.</p>\n<p><a class='ref ttc' id='ttc32' href='#ttc32'>TTC 32</a>Rồi Tôn giả Anuruddha, mùa mưa an cư đến, đến trú ở giữa dân chúng Cetì, tại Pacìnavamsadàya. Rồi Tôn giả Anuruddha sống một mình, an tịnh, không phóng dật, nhiệt tâm, tinh cần, không bao lâu, do mục đích gì, các Thiện nam tử chơn chánh xuất gia, từ bỏ gia đình, sống không gia đình, tức là vô thượng cứu cánh Phạm hạnh ngay trong hiện tại, vị ấy tự mình với thắng trí, chứng ngộ, chứng nhập và an trú. Vị ấy chứng rõ: “Sanh đã tận, Phạm hạnh đã thành, những gì nên làm đã làm, không còn trở lui lại trạng thái này nữa” và Tôn giả Anuruddha trở thành một vị A-la-hán nữa. Rồi Tôn Giả Anuruđha chứng được A-la-hán ngay trong thời gian ấy, nói lên những bài kệ này:</p>\n<blockquote class='gatha'>\n<p>Thế gian vô thượng sư<br>\nRõ biết tư tưởng ta<br>\nVới thân do ý tạo<br>\nThần thông đến với ta<br>\nTùy theo ta nghĩ gì<br>\nNgài thuyết rõ tất cả<br>\nPhật không ưa hý luận<br>\nNgài thuyết, không hý luận<br>\nNgộ pháp, ta hoan hỷ<br>\nTrú trong giáo pháp ngài<br>\nBa minh đã đạt được<br>\nGiáo pháp Phật làm xong.</p>\n</blockquote>\n<footer>\n<p>Bộ kinh nầy được <span class='author'>Hòa thượng Thích Minh Châu</span> dịch từ tạng Pali sang Việt ngữ năm 1976–1977, và được Viện Phật Học Vạn Hạnh, Sài Gòn, ấn hành năm <span class='publication-date'>1980–1981</span>. Trong chương trình phiên dịch và ấn hành Ðại tạng kinh Việt Nam, bộ kinh được hiệu đính thành 4 tập và tái bản năm 1996, qua số thứ tự 21, 22, 23, và 24.</p>\n<p>These texts have been used with the kind permission of the webmaster of <a href='http://www.budsas.net/'>http://www.budsas.net/</a></p>\n<p>Prepared for SuttaCentral by <span class='editor'>Ayya Vimala</span>.</p>\n</footer>\n</article>\n</body>\n</html>\n"
  },
  "translation": {
    "uid": "an8.30",
    "lang": "vi",
    "is_root": false,
    "title": "Tôn Giả Anuruddha",
    "author": "Thích Minh Châu",
    "author_short": "Minh Châu",
    "author_uid": "minh_chau",
    "next": {
      "author_uid": "minh_chau",
      "lang": "vi",
      "name": "Giving (1st) ",
      "uid": "an8.31"
    },
    "previous": {
      "author_uid": "minh_chau",
      "lang": "vi",
      "name": "Lost Opportunities ",
      "uid": "an8.29"
    },
    "text": "<!DOCTYPE html>\n<html>\n<head>\n<meta charset='UTF-8'>\n<meta name='author' content='Thích Minh Châu'>\n<title></title>\n</head>\n<body>\n<article id='an8.30' lang='vi'>\n<header>\n<ul>\n<li class='division' lang='pli' translate='no'>Aṅguttara Nikāya</li>\n<li><span class='roman-numerals'>III</span>. Phẩm Gia Chủ</li>\n</ul>\n<h1>8.30. Tôn Giả Anuruddha</h1>\n</header>\n<p><a class='ref ttc' id='ttc1' href='#ttc1'>TTC 1</a>Một thời, Thế Tôn trú ở giữa dân chúng Bhagga, tại núi Sumsumàra, rừng Bhesakala, vườn Lộc Uyển. Lúc bấy giờ, Tôn giả Anuruddha (A-nậu-lâu-đà) sống giữa dân chúng Celì, tại Pàcìnavamsadàya, Rồi Tôn giả Anuruddha, trong khi sống độc cư … Thiền tịnh, tâm tư khởi lên như sau: “Pháp này để cho người ít dục, pháp này không phải để cho người nhiều dục; Pháp này để cho người biết đủ, pháp này không phải để cho người không biết đủ; Pháp này để cho người sống thanh vắng, pháp này không phải để cho người ưa hội chúng; Pháp này để cho người tinh cần tinh tấn, pháp này không phải để cho người biếng nhác; Pháp này để cho người trú niệm, pháp này không phải để cho người thất niệm; Pháp này để cho người Thiền định, pháp này không phải để cho người không Thiền định; Pháp này để cho người có trí tuệ, pháp này không phải để cho người ác tuệ”.</p>\n<p><a class='ref ttc' id='ttc2' href='#ttc2'>TTC 2</a>Rồi Thế Tôn với tâm của mình rõ biết tâm tư của Tôn giả Anuruddha, ví như người lực sĩ duỗi bàn tay đang co lại; hay co lại bàn tay đang duỗi ra; cũng vậy, Thế Tôn biến mất ở giữa dân chúng Bhagga, tại núi Sumsumàra, rừng Bhesakalà, vườn Lộc Uyển, và hiện ra giữa dân chúng Celì, tại Pàcìnavamsadàya, trước mặt Tôn giả Anuruddha. Thế Tôn ngồi xuống trên chỗ đã soạn sẵn. Rồi Thế Tôn nói với Tôn giả Anuruddha đang ngồi một bên:</p>\n<p><a class='ref ttc' id='ttc3' href='#ttc3'>TTC 3</a>—Lành thay, lành thay, này Anuruddha! Lành thay, này Anuruddha, Thầy đã suy nghĩ đến bảy niệm của bậc Ðại nhân: “ Pháp này để cho người ít dục, pháp này không phải để cho người nhiều dục; Pháp này để cho người biết đủ, pháp này không phải để cho người không biết đủ; Pháp này để cho người sống thanh vắng, pháp này không phải để cho người ưa hội chúng; Pháp này để cho người tinh cần tinh tấn, pháp này không phải để cho người biếng nhác; Pháp này để cho người trú niệm, pháp này không phải để cho người thất niệm; Pháp này để cho người Thiền định, pháp này không phải để cho người không Thiền định; Pháp này để cho người có trí tuệ, pháp này không phải để cho người ác tuệ”.</p>\n<p>Do vậy, này Anuruddha, hãy suy nghĩ đến niệm thứ tám này của bậc Ðại nhân: “Pháp này để cho người không ưa hý luận, không thích hý luận, Pháp này không phải để cho người ưa hý luận, thích hý luận “.</p>\n<p><a class='ref ttc' id='ttc4' href='#ttc4'>TTC 4</a>Khi nào, này Anuruddha, Thầy sẽ suy nghĩ đến tám tư niệm này của bậc Ðại nhân, thời nếu Thầy muốn, Thầy sẽ chứng đạt và an trú Thiền thứ nhất, một trạng thái hỷ lạc do ly dục sanh, có tầm có tứ.</p>\n<p><a class='ref ttc' id='ttc5' href='#ttc5'>TTC 5</a>Khi nào, này Anuruddha, Thầy sẽ suy nghĩ đến tám tư niệm này của bậc Ðại nhân, thời nếu Thầy muốn, diệt tầm diệt tứ, Thầy sẽ chứng đạt và an trú Thiền thứ hai, một trạng thái hỷ lạc do định sanh, không tầm không tứ, nội tĩnh nhất tâm.</p>\n<p><a class='ref ttc' id='ttc6' href='#ttc6'>TTC 6</a>Khi nào, này Anuruddha, khi nào Thầy sẽ suy nghĩ đến tám tư niệm này của bậc Ðại nhân, thời nếu Thầy muốn, Thầy sẽ ly hỷ trú xả, chánh niệm tỉnh giác, thân cảm sự lạc thọ mà các bậc Thánh gọi là “xả niệm lạc trú”, chứng và an trú Thiền thứ ba.</p>\n<p><a class='ref ttc' id='ttc7' href='#ttc7'>TTC 7</a>Khi nào, này Anuruddha, Thầy sẽ suy nghĩ đến tám tư niệm này của bậc Ðại nhân, thời nếu Thầy muốn, Thầy sẽ xả lạc xả khổ, diệt hỷ ưu đã cảm thọ trước, chứng và an trú Thiền thứ tư, không khổ, không lạc, xả niệm thanh tịnh.</p>\n<p><a class='ref ttc' id='ttc8' href='#ttc8'>TTC 8</a>Khi nào, này Anuruddha, Thầy sẽ suy nghĩ đến tám tư niệm này của bậc Ðại nhân, khi nào bốn Thiền này thuộc tăng thượng tâm, hiện tại lạc trú, chứng được không khó khăn, chứng được không mệt nhọc, chứng được không phí sức, thời này Anuruddha, tấm y lượm từ đống rác lên của Thầy sẽ giống như tủ áo đầy những vải có nhiều màu sắc của người gia chủ hay con người gia chủ, để được sống biết đủ, ưa thích, không có lo âu, được lạc trú, được bước vào Niết-bàn.</p>\n<p><a class='ref ttc' id='ttc9' href='#ttc9'>TTC 9</a>Khi nào, này Anuruddha, Thầy sẽ suy nghĩ đến tám tư niệm này của bậc Ðại nhân, thời nếu Thầy muốn, khi nào bốn Thiền này thuộc tăng thượng tâm, hiện tại lạc trú, chứng được không khó khăn, chứng được không mệt nhọc, chứng được không phí sức, thời này Anuruddha, các món ăn từng miếng Thầy khất thực được sẽ giống như món cơm bằng gạo trắng, các hạt đen đã được lượm sạch, với nhiều loại súp, với nhiều loại đồ ăn của người gia chủ, hay của con người gia chủ, để được sống biết đủ, ưa thích, không có lo âu, được lạc trú, được bước vào Niết-bàn.</p>\n<p><a class='ref ttc' id='ttc10' href='#ttc10'>TTC 10</a>Khi nào, này Anuruddha, Thầy sẽ suy nghĩ đến tám tư niệm này của bậc Ðại nhân, khi nào bốn Thiền này thuộc tăng thượng tâm, hiện tại lạc trú, chứng được không khó khăn, chứng được không mệt nhọc, chứng được không phí sức, thời này Anuruddha, chỗ nằm dưới gốc cây thầy sẽ giống như nhà có nóc nhọn, có trét hồ trong ngoài, cửa được cài then, cửa sổ được đóng lại ngăn chặn gió của người gia chủ, hay của con người gia chủ, để được sống biết đủ, ưa thích, không có lo âu, được lạc trú, được bước vào Niết-bàn.</p>\n<p><a class='ref ttc' id='ttc11' href='#ttc11'>TTC 11</a>Khi nào, này Anuruddha, Thầy sẽ suy nghĩ đến tám tư niệm này của bậc Ðại nhân, khi nào bốn Thiền này thuộc tăng thượng tâm, hiện tại lạc trú, chứng được không khó khăn, chứng được không mệt nhọc, chứng được không phí sức, thời này Anuruddha, giường nằm và chỗ ngồi trải với đệm cỏ của Thầy sẽ giống như ghế dài, nệm trải giường nằm bằng len, chăn len trắng, chăn len thêu bông, nệm bằng da con sơn dương gọi là kadali, tấm thảm với đầu che phía trên, ghế dài có đầu gối chân màu đỏ của các người gia chủ, hay của con người gia chủ, để được sống biết đủ, ưa thích, không có lo âu, được lạc trú, được bước vào Niết-bàn.</p>\n<p><a class='ref ttc' id='ttc12' href='#ttc12'>TTC 12</a>Khi nào, này Anuruddha, Thầy sẽ suy nghĩ đến tám tư niệm này của bậc Ðại nhân, khi nào bốn Thiền này thuộc tăng thượng tâm, hiện tại lạc trú, chứng được không khó khăn, chứng được không mệt nhọc, chứng được không phí sức, thời này Anuruddha, dược phẩm nước tiểu hôi của Thầy sẽ giống như các loại dược phẩm của các người gia chủ, hay của con người gia chủ, như thục tô, sanh tô, dầu, mật, đường bánh, để được sống biết đủ, ưa thích, không có lo âu, được lạc trú, được bước vào Niết-bàn.</p>\n<p><a class='ref ttc' id='ttc13' href='#ttc13'>TTC 13</a>Vậy này Anuruddha, nhân kỳ an cư mùa mưa sắp đến, hãy trú giữa dân chúng Cetì ở Pàcìnavamsadàya.</p>\n<p>—Thưa vâng, bạch Thế Tôn.</p>\n<p>Tôn giả Anuruddha vâng đáp Thế Tôn. Rồi Thế Tôn sau khi khuyến giáo Tôn giả Anuruddha với lời khuyến giáo này, như người lực sĩ duỗi cánh tay đang co lại, hay co lại cánh tay đang duỗi ra; cũng vậy, Ngài biến mất giữa dân chúng Cetì ở Pàcìnavamsadàya và hiện ra giữa dân chúng Bhagga, trên núi Sumsumàra trong rừng Bhesakalà, vườn Lộc Uyển. Thế Tôn ngồi xuống trên chỗ đã soạn sẵn, sau khi ngồi xuống, Thế Tôn bảo các Tỷ-kheo:</p>\n<p><a class='ref ttc' id='ttc14' href='#ttc14'>TTC 14</a>—Này các Tỷ-kheo, Ta sẽ thuyết tám tư niệm của bậc Ðại nhân cho các Thầy. Hãy lắng nghe và khéo tư niệm, Ta sẽ giảng:</p>\n<p>—Thưa vâng, bạch Thế Tôn.</p>\n<p>Các Tỷ-kheo ấy vâng đáp Thế Tôn. Thế Tôn nói như sau:</p>\n<p>—Này các Tỷ-kheo, thế nào là tám tư niệm của bậc Ðại nhân?</p>\n<p><a class='ref ttc' id='ttc15' href='#ttc15'>TTC 15</a>Này các Tỷ-kheo, Pháp này để cho người ít dục, Pháp này không phải để cho người nhiều dục; Này các Tỷ kheo,Pháp này để cho người biết đủ, pháp này không phải để cho người không biết đủ; Này các Tỷ kheo, Pháp này để cho người sống thanh vắng, pháp này không phải để cho người ưa hội chúng; Này các Tỷ kheo, Pháp này để cho người tinh cần tinh tấn, pháp này không phải để cho người biếng nhác; Này các Tỷ kheo,Pháp này để cho người trú niệm, pháp này không phải để cho người thất niệm; Này các Tỷ kheo, Pháp này để cho người Thiền định, pháp này không phải để cho người không Thiền định; Này các Tỷ kheo, Pháp này để cho người có trí tuệ, Pháp này không phải để cho người ác tuệ; Này các Tỷ-kheo, Pháp này để cho người không ưa hý luận, không thích hý luận, Pháp này không phải để cho người ưa hý luận, thích hý luận.</p>\n<p><a class='ref ttc' id='ttc16' href='#ttc16'>TTC 16</a>Này các Tỷ-kheo, “Pháp này để cho người ít dục, Pháp này không để cho người có dục lớn”, như vậy đã được nói đến. Do duyên gì được nói như vậy?</p>\n<p><a class='ref ttc' id='ttc17' href='#ttc17'>TTC 17</a>Này các Tỷ-kheo, ở đây, Tỷ-kheo ít dục không muốn: “Mong người ta biết tôi là ít dục”; biết đủ, không muốn: “Mong người ta biết tôi là biết đủ”; sống viễn ly, không muốn: “Mong người ta biết tôi sống viễn ly”; tinh cần tinh tấn, không muốn: “Mong người ta biết tôi sống tinh cần tinh tấn”; trú niệm, không muốn: “Mong người ta biết tôi trú niệm”; có định, không muốn: “Mong người ta biết tôi có định”; có tuệ, không muốn: “Mong người ta biết tôi là người có tuệ “; không thích hý luận, không muốn: “Mong người ta biết tôi không thích hý luận”. Này các Tỷ-kheo, Pháp này để cho người ít dục, Pháp này không để cho người có dục lớn”, đã được nói đến như vậy. Do duyên này được nói như vậy.</p>\n<p><a class='ref ttc' id='ttc18' href='#ttc18'>TTC 18</a>Này các Tỷ-kheo, “Pháp này để cho người biết đủ, Pháp này không để cho người không biết đủ”, như vậy đã được nói đến. Do duyên gì được nói như vậy?</p>\n<p><a class='ref ttc' id='ttc19' href='#ttc19'>TTC 19</a>Ở đây, này các Tỷ-kheo, Tỷ-kheo biết đủ với bất cứ vật dụng gì như y áo, đồ ăn khất thực, sàng tọa, dược phẩm trị bệnh. Này các Tỷ-kheo, “Pháp này để cho người biết đủ, Pháp này không phải để cho người không biết đủ”, đã được nói đến như vậy. Do duyên này được nói như vậy.</p>\n<p><a class='ref ttc' id='ttc20' href='#ttc20'>TTC 20</a>Này các Tỷ-kheo, Pháp này để cho người sống viễn ly, “Pháp này không phải để cho người ưa thích hội chúng”, như vậy đã được nói đến. Do duyên gì được nói như vậy?</p>\n<p><a class='ref ttc' id='ttc21' href='#ttc21'>TTC 21</a>Ở đây, này các Tỷ-kheo, Với Tỷ-kheo sống viễn ly, có nhiều người đến thăm như Tỷ-kheo, Tỷ-kheo-Ni, nam cư sĩ, nữ cư sĩ, vua chúa, đại thần, các ngoại đạo sư, đệ tử của các ngoại đạo sư. Ở đây, Tỷ-kheo với tâm thuận về viễn ly, hướng về viễn ly, nhập vào viễn ly, trú vào viễn ly, thích thú xuất ly, nói lời hoàn toàn liên hệ đến lánh xa. Này các Tỷ-kheo, Pháp này để cho người viễn ly, “Pháp này không phải để cho người không ưa hội chúng”, đã được nói đến như vậy. Do duyên này được nói như vậy.</p>\n<p><a class='ref ttc' id='ttc22' href='#ttc22'>TTC 22</a>Này các Tỷ-kheo, Pháp này để cho người tinh cần tinh tấn, “Pháp này không phải để cho người biếng nhác”, như vậy đã được nói đến. Do duyên gì được nói như vậy?</p>\n<p><a class='ref ttc' id='ttc23' href='#ttc23'>TTC 23</a>Ở đây, này các Tỷ-kheo, Tỷ-kheo sống tinh cần tinh tấn, đoạn tận các pháp bất thiện, thành tựu các Pháp thiện, nỗ lực kiên trì, không từ bỏ gánh nặng đối với các thiện pháp. Này các Tỷ-kheo, Pháp này để cho người tinh cần tinh tấn, “Pháp này không phải để cho người biếng nhác”, đã được nói đến như vậy. Do duyên này được nói như vậy.</p>\n<p><a class='ref ttc' id='ttc24' href='#ttc24'>TTC 24</a>Này các Tỷ-kheo, Pháp này để cho người trú niệm, “Pháp này không phải để cho người thất niệm”, như vậy đã được nói đến. Do duyên gì được nói như vậy?</p>\n<p><a class='ref ttc' id='ttc25' href='#ttc25'>TTC 25</a>Ở đây, này các Tỷ-kheo, Tỷ-kheo đầy đủ niệm, thành tựu niệm tuệ tối thắng, ức nhớ tùy niệm những điều đã làm, nói đã lâu. Này các Tỷ-kheo, “Pháp này để cho người trú niệm, Pháp này không phải để cho người thất niệm”, đã được nói đến như vậy. Do duyên này được nói như vậy.</p>\n<p><a class='ref ttc' id='ttc26' href='#ttc26'>TTC 26</a>Này các Tỷ-kheo, Pháp này để cho người thiền định, “Pháp này không phải để cho người không thiền định”, như vậy đã được nói đến. Do duyên gì được nói như vậy?</p>\n<p><a class='ref ttc' id='ttc27' href='#ttc27'>TTC 27</a>Ở đây, này các Tỷ-kheo, Tỷ-kheo ly dục, ly ác pháp … chứng đạt và an trú Thiền thứ tư. Này các Tỷ-kheo, Pháp này để cho người thiền định, “Pháp này không phải để cho người không thiền định”, đã được nói đến như vậy. Do duyên này được nói như vậy.</p>\n<p><a class='ref ttc' id='ttc28' href='#ttc28'>TTC 28</a>Này các Tỷ-kheo, Pháp này để cho người có trí tuệ, “Pháp này không phải để cho người không trí tuệ”, như vậy đã được nói đến. Do duyên gì được nói như vậy?</p>\n<p><a class='ref ttc' id='ttc29' href='#ttc29'>TTC 29</a>Ở đây, này các Tỷ-kheo, Tỷ-kheo có trí tuệ, có trí tuệ về sanh diệt, thành tựu Thánh thể nhập (quyết trạch), đưa đến chơn chánh đoạn diệt khổ đau. Này các Tỷ-kheo, “Pháp này để cho người có trí tuệ, Pháp này không phải để cho người không trí tuệ”, đã được nói đến như vậy. Do duyên này được nói như vậy</p>\n<p><a class='ref ttc' id='ttc30' href='#ttc30'>TTC 30</a>Này các Tỷ-kheo, Pháp này để cho người không ưa hý luận, không thích hý luận, “Pháp này không phải để cho người ưa hý luận, thích hý luận”, như vậy đã được nói đến. Do duyên gì được nói như vậy?</p>\n<p><a class='ref ttc' id='ttc31' href='#ttc31'>TTC 31</a>Này các Tỷ-kheo, ở đây, Tỷ-kheo đối với đoạn diệt hý luận, tâm được phấn chấn, tịnh tín, an trú, hướng đến. Này các Tỷ-kheo, Pháp này để cho người không ưa hý luận, không thích hý luận, “Pháp này không phải để cho người ưa hý luận, thích hý luận”, đã được nói đến như vậy. Do duyên này được nói như vậy.</p>\n<p><a class='ref ttc' id='ttc32' href='#ttc32'>TTC 32</a>Rồi Tôn giả Anuruddha, mùa mưa an cư đến, đến trú ở giữa dân chúng Cetì, tại Pacìnavamsadàya. Rồi Tôn giả Anuruddha sống một mình, an tịnh, không phóng dật, nhiệt tâm, tinh cần, không bao lâu, do mục đích gì, các Thiện nam tử chơn chánh xuất gia, từ bỏ gia đình, sống không gia đình, tức là vô thượng cứu cánh Phạm hạnh ngay trong hiện tại, vị ấy tự mình với thắng trí, chứng ngộ, chứng nhập và an trú. Vị ấy chứng rõ: “Sanh đã tận, Phạm hạnh đã thành, những gì nên làm đã làm, không còn trở lui lại trạng thái này nữa” và Tôn giả Anuruddha trở thành một vị A-la-hán nữa. Rồi Tôn Giả Anuruđha chứng được A-la-hán ngay trong thời gian ấy, nói lên những bài kệ này:</p>\n<blockquote class='gatha'>\n<p>Thế gian vô thượng sư<br>\nRõ biết tư tưởng ta<br>\nVới thân do ý tạo<br>\nThần thông đến với ta<br>\nTùy theo ta nghĩ gì<br>\nNgài thuyết rõ tất cả<br>\nPhật không ưa hý luận<br>\nNgài thuyết, không hý luận<br>\nNgộ pháp, ta hoan hỷ<br>\nTrú trong giáo pháp ngài<br>\nBa minh đã đạt được<br>\nGiáo pháp Phật làm xong.</p>\n</blockquote>\n<footer>\n<p>Bộ kinh nầy được <span class='author'>Hòa thượng Thích Minh Châu</span> dịch từ tạng Pali sang Việt ngữ năm 1976–1977, và được Viện Phật Học Vạn Hạnh, Sài Gòn, ấn hành năm <span class='publication-date'>1980–1981</span>. Trong chương trình phiên dịch và ấn hành Ðại tạng kinh Việt Nam, bộ kinh được hiệu đính thành 4 tập và tái bản năm 1996, qua số thứ tự 21, 22, 23, và 24.</p>\n<p>These texts have been used with the kind permission of the webmaster of <a href='http://www.budsas.net/'>http://www.budsas.net/</a></p>\n<p>Prepared for SuttaCentral by <span class='editor'>Ayya Vimala</span>.</p>\n</footer>\n</article>\n</body>\n</html>\n"
  },
  "segmented": false,
  "suttaplex": {
    "acronym": "AN 8.30",
    "volpages": " PTS 4.229, PTS 4.230, PTS 4.231, PTS 4.232, PTS 4.233, PTS 4.234, PTS 4.235",
    "alt_volpages": null,
    "uid": "an8.30",
    "blurb": "Venerable Anuruddha reflects that the teachings is for someone who is of few wishes, content, secluded, energetic, mindful, peaceful, and wise. To these seven thoughts, the Buddha adds an eighth: the teaching is for those who delight in non-proliferation. Practicing in line with these eight thoughts of a great man, Venerable Anuruddha achieves perfection.",
    "difficulty": null,
    "original_title": "Anuruddhamahāvitakkasutta",
    "root_lang": "pli",
    "root_lang_name": "Pāli",
    "type": "leaf",
    "from": null,
    "translated_title": "Tôn Giả Anuruddha",
    "translations": [
      {
        "lang": "de",
        "lang_name": "Deutsch",
        "is_root": false,
        "author": "Sabbamitta",
        "author_short": "sabbamitta",
        "author_uid": "sabbamitta",
        "publication_date": "2019",
        "id": "an8.30_translation-de-sabbamitta",
        "segmented": true,
        "title": "Anuruddha und die großen Gedanken ",
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "en",
        "lang_name": "English",
        "is_root": false,
        "author": "Bhikkhu Sujato",
        "author_short": "sujato",
        "author_uid": "sujato",
        "publication_date": "2018",
        "id": "an8.30_translation-en-sujato",
        "segmented": true,
        "title": "Anuruddha and the Great Thoughts ",
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "fr",
        "lang_name": "Français",
        "is_root": false,
        "author": "Christelle Ah-Mouck",
        "author_short": "christelle",
        "author_uid": "christelle",
        "publication_date": "2025",
        "id": "an8.30_translation-fr-christelle",
        "segmented": true,
        "title": "Anuruddha et les Grandes Pensées ",
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "pli",
        "lang_name": "Pāli",
        "is_root": true,
        "author": "Mahāsaṅgīti Tipiṭaka Buddhavasse 2500",
        "author_short": "ms",
        "author_uid": "ms",
        "publication_date": null,
        "id": "an8.30_root-pli-ms",
        "segmented": true,
        "title": null,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "bn",
        "lang_name": "বাংলা",
        "is_root": false,
        "author": "সুমঙ্গল বড়ুয়া",
        "author_short": "বড়ুয়া",
        "author_uid": "sumangal-barua",
        "publication_date": "2018",
        "id": "bn_an8.30_sumangal-barua",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "de",
        "lang_name": "Deutsch",
        "is_root": false,
        "author": "Nyānatiloka Thera",
        "author_short": "Nyanatiloka",
        "author_uid": "nyanatiloka",
        "publication_date": "1907",
        "id": "de_an8.30_nyanatiloka",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "en",
        "lang_name": "English",
        "is_root": false,
        "author": "Bhikkhu Bodhi",
        "author_short": "Bodhi",
        "author_uid": "bodhi",
        "publication_date": "2012",
        "id": "en_an8.30_bodhi",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "es",
        "lang_name": "Español",
        "is_root": false,
        "author": "Dr. Ricardo de León",
        "author_short": "León",
        "author_uid": "leon",
        "publication_date": "2012",
        "id": "es_an8.30_leon",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "id",
        "lang_name": "Bahasa Indonesia",
        "is_root": false,
        "author": "Indra Anggara",
        "author_short": "Anggara",
        "author_uid": "anggara",
        "publication_date": null,
        "id": "id_an8.30_anggara",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "it",
        "lang_name": "Italiano",
        "is_root": false,
        "author": "Enzo Alfano",
        "author_short": "Alfano",
        "author_uid": "alfano",
        "publication_date": null,
        "id": "it_an8.30_alfano",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "jpn",
        "lang_name": "日本語",
        "is_root": false,
        "author": "関西パーリ語実習会",
        "author_short": "関西パーリ語実習会",
        "author_uid": "kansai",
        "publication_date": "2023",
        "id": "jpn_an8.30_kansai",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "my",
        "lang_name": "မြန်မာဘာသာ",
        "is_root": false,
        "author": "Pitaka Myanmar Translation",
        "author_short": "PMT",
        "author_uid": "pmt",
        "publication_date": null,
        "id": "my_an8.30_pmt",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "pt",
        "lang_name": "Português",
        "is_root": false,
        "author": "Michael Beisert",
        "author_short": "Beisert",
        "author_uid": "beisert",
        "publication_date": "2013",
        "id": "pt_an8.30_beisert",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "ru",
        "lang_name": "Русский",
        "is_root": false,
        "author": "SV",
        "author_short": "SV",
        "author_uid": "sv",
        "publication_date": "2014",
        "id": "ru_an8.30_sv",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "si",
        "lang_name": "සිංහල",
        "is_root": false,
        "author": "A.P. de Zoysa",
        "author_short": "Zoysa",
        "author_uid": "zoysa",
        "publication_date": null,
        "id": "si_an8.30_zoysa",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "lang": "th",
        "lang_name": "ไทย",
        "is_root": false,
        "author": "Siam Rath",
        "author_short": "Siam Rath",
        "author_uid": "siam_rath",
        "publication_date": null,
        "id": "th_an8.30_siam_rath",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      },
      {
        "author": "Thích Minh Châu",
        "author_short": "Minh Châu",
        "author_uid": "minh_chau",
        "has_comment": false,
        "id": "vi_an8.30_minh_chau",
        "is_root": false,
        "lang": "vi",
        "lang_name": "Tiếng Việt",
        "publication_date": "1980–1981",
        "segmented": false,
        "volpage": null,
        "title": "Tôn Giả Anuruddha"
      },
      {
        "lang": "zh",
        "lang_name": "汉语",
        "is_root": false,
        "author": "莊春江",
        "author_short": "莊春江",
        "author_uid": "zhuang",
        "publication_date": null,
        "id": "zh_an8.30_zhuang",
        "segmented": false,
        "volpage": null,
        "has_comment": false
      }
    ],
    "parallel_count": 5,
    "biblio": null,
    "priority_author_uid": null,
    "verseNo": "bj22.136, ms17A8_293, msdiv30, ndp3.331, pts-vp-pli4.229, vri39.63,csp1ed17.63, csp2ed17.63, dr23.249, ms17A8_294,bj22.138, ms17A8_295,ms17A8_296, pts-vp-pli4.230,ms17A8_297, ndp3.332,csp1ed17.64, csp2ed17.64, dr23.250, ms17A8_298, vri39.64,ms17A8_299,ms17A8_300,bj22.140, ms17A8_301, pts-vp-pli4.231,dr23.251, ms17A8_302, ndp3.333,csp1ed17.65, csp2ed17.65, ms17A8_303, vri39.65,bj22.142, ms17A8_304, pts-vp-pli4.232,dr23.252, ms17A8_305, ndp3.334, pts-vp-pli4.233,bj22.144, csp1ed17.66, csp2ed17.66, dr23.253, ms17A8_306, vri39.66,ms17A8_307,ms17A8_308, pts-vp-pli4.234,bj22.146, csp1ed17.67, csp2ed17.67, ms17A8_309, ndp3.335,dr23.254, ms17A8_310, vri39.67,ms17A8_311,ms17A8_312,ms17A8_313, pts-vp-pli4.235,bj22.148, csp1ed17.68, csp2ed17.68, dr23.255, ms17A8_314, ndp3.336,ms17A8_315, vri39.68,ms17A8_316,ms17A8_317,ms17A8_321",
    "previous": {
      "name": null,
      "uid": null
    },
    "next": {
      "name": null,
      "uid": null
    }
  },
  "bilara_root_text": {
    "uid": "an8.30",
    "author": "Mahāsaṅgīti Tipiṭaka Buddhavasse 2500",
    "author_short": "ms",
    "author_uid": "ms",
    "lang": "pli",
    "title": "Anuruddhamahāvitakkasutta",
    "previous": {
      "author_uid": "ms",
      "lang": "pli",
      "name": null,
      "uid": null
    },
    "next": {
      "author_uid": "ms",
      "lang": "pli",
      "name": null,
      "uid": null
    }
  },
  "bilara_translated_text": null,
  "candidate_authors": [
    "sujato",
    "bodhi"
  ]
}